/* automatically generated by rust-bindgen 0.69.5 */

pub const SUN_C_COMPILER: &[u8; 4] = b"GNU\0";
pub const SUN_C_COMPILER_VERSION: &[u8; 7] = b"13.3.0\0";
pub const SUN_C_COMPILER_FLAGS: &[u8; 51] = b" -ffunction-sections -fdata-sections -fPIC -m64 -w\0";
pub const SUN_CXX_COMPILER: &[u8; 1] = b"\0";
pub const SUN_CXX_COMPILER_VERSION: &[u8; 1] = b"\0";
pub const SUN_CXX_COMPILER_FLAGS: &[u8; 51] =
    b" -ffunction-sections -fdata-sections -fPIC -m64 -w\0";
pub const SUN_FORTRAN_COMPILER: &[u8; 1] = b"\0";
pub const SUN_FORTRAN_COMPILER_VERSION: &[u8; 1] = b"\0";
pub const SUN_FORTRAN_COMPILER_FLAGS: &[u8; 1] = b"\0";
pub const SUN_BUILD_TYPE: &[u8; 8] = b"Release\0";
pub const SUN_JOB_ID: &[u8; 15] = b"20260705233935\0";
pub const SUN_JOB_START_TIME: &[u8; 15] = b"20260705233935\0";
pub const SUN_TPL_LIST: &[u8; 1] = b"\0";
pub const SUN_TPL_LIST_SIZE: &[u8; 1] = b"\0";
pub const SUN_GINKGO_VERSION: &[u8; 1] = b"\0";
pub const SUN_HYPRE_VERSION: &[u8; 1] = b"\0";
pub const SUN_KLU_VERSION: &[u8; 1] = b"\0";
pub const SUN_KOKKOS_VERSION: &[u8; 1] = b"\0";
pub const SUN_KOKKOS_KERNELS_VERSION: &[u8; 1] = b"\0";
pub const SUN_LAPACK_VERSION: &[u8; 1] = b"\0";
pub const SUN_MAGMA_VERSION: &[u8; 1] = b"\0";
pub const SUN_MPI_C_COMPILER: &[u8; 1] = b"\0";
pub const SUN_MPI_C_VERSION: &[u8; 1] = b"\0";
pub const SUN_MPI_CXX_COMPILER: &[u8; 1] = b"\0";
pub const SUN_MPI_CXX_VERSION: &[u8; 1] = b"\0";
pub const SUN_MPI_FORTRAN_COMPILER: &[u8; 1] = b"\0";

pub const SUNOutputFormat_SUN_OUTPUTFORMAT_CSV: SUNOutputFormat = 1;
pub type SUNOutputFormat = ::std::os::raw::c_uint;
pub type SUNErrCode = ::std::os::raw::c_int;
pub type SUNContext = *mut SUNContext_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SUNErrHandler_ {
    _unused: [u8; 0],
}
pub type SUNErrHandler = *mut SUNErrHandler_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SUNProfiler_ {
    _unused: [u8; 0],
}
pub type SUNProfiler = *mut SUNProfiler_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SUNLogger_ {
    _unused: [u8; 0],
}
pub type SUNLogger = *mut SUNLogger_;
pub type SUNErrHandlerFn = ::std::option::Option<
    unsafe extern "C" fn(
        line: ::std::os::raw::c_int,
        func: *const ::std::os::raw::c_char,
        file: *const ::std::os::raw::c_char,
        msg: *const ::std::os::raw::c_char,
        err_code: SUNErrCode,
        err_user_data: *mut ::std::os::raw::c_void,
        sunctx: SUNContext,
    ),
>;
pub type SUNComm = ::std::os::raw::c_int;
pub const SUNDataIOMode_SUNDATAIOMODE_INMEM: SUNDataIOMode = 0;
pub type SUNDataIOMode = ::std::os::raw::c_uint;
pub type FILE = _IO_FILE;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_marker {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_codecvt {
    _unused: [u8; 0],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_wide_data {
    _unused: [u8; 0],
}
pub type _IO_lock_t = ::std::os::raw::c_void;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _IO_FILE {
    pub _flags: ::std::os::raw::c_int,
    pub _IO_read_ptr: *mut ::std::os::raw::c_char,
    pub _IO_read_end: *mut ::std::os::raw::c_char,
    pub _IO_read_base: *mut ::std::os::raw::c_char,
    pub _IO_write_base: *mut ::std::os::raw::c_char,
    pub _IO_write_ptr: *mut ::std::os::raw::c_char,
    pub _IO_write_end: *mut ::std::os::raw::c_char,
    pub _IO_buf_base: *mut ::std::os::raw::c_char,
    pub _IO_buf_end: *mut ::std::os::raw::c_char,
    pub _IO_save_base: *mut ::std::os::raw::c_char,
    pub _IO_backup_base: *mut ::std::os::raw::c_char,
    pub _IO_save_end: *mut ::std::os::raw::c_char,
    pub _markers: *mut _IO_marker,
    pub _chain: *mut _IO_FILE,
    pub _fileno: ::std::os::raw::c_int,
    pub _flags2: ::std::os::raw::c_int,
    pub _old_offset: __off_t,
    pub _cur_column: ::std::os::raw::c_ushort,
    pub _vtable_offset: ::std::os::raw::c_schar,
    pub _shortbuf: [::std::os::raw::c_char; 1usize],
    pub _lock: *mut _IO_lock_t,
    pub _offset: __off64_t,
    pub _codecvt: *mut _IO_codecvt,
    pub _wide_data: *mut _IO_wide_data,
    pub _freeres_list: *mut _IO_FILE,
    pub _freeres_buf: *mut ::std::os::raw::c_void,
    pub __pad5: usize,
    pub _mode: ::std::os::raw::c_int,
    pub _unused2: [::std::os::raw::c_char; 20usize],
}
#[test]
fn bindgen_test_layout__IO_FILE() {
    const UNINIT: ::std::mem::MaybeUninit<_IO_FILE> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_IO_FILE>(),
        216usize,
        concat!("Size of: ", stringify!(_IO_FILE))
    );
    assert_eq!(
        ::std::mem::align_of::<_IO_FILE>(),
        8usize,
        concat!("Alignment of ", stringify!(_IO_FILE))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._flags) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_ptr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_end) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_read_base) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_read_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_base) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_ptr) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_write_end) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_write_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_buf_base) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_buf_end) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_buf_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_save_base) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_backup_base) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_backup_base)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._IO_save_end) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_IO_save_end)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._markers) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_markers)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._chain) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_chain)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._fileno) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_fileno)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._flags2) as usize - ptr as usize },
        116usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_flags2)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._old_offset) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_old_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._cur_column) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_cur_column)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._vtable_offset) as usize - ptr as usize },
        130usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_vtable_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._shortbuf) as usize - ptr as usize },
        131usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_shortbuf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._lock) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_lock)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._offset) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_offset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._codecvt) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_codecvt)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._wide_data) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_wide_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._freeres_list) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_list)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._freeres_buf) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_freeres_buf)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).__pad5) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(__pad5)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._mode) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_mode)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr)._unused2) as usize - ptr as usize },
        196usize,
        concat!(
            "Offset of field: ",
            stringify!(_IO_FILE),
            "::",
            stringify!(_unused2)
        )
    );
}
impl Default for _IO_FILE {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SUNContext_ {
    pub profiler: SUNProfiler,
    pub own_profiler: ::std::os::raw::c_int,
    pub logger: SUNLogger,
    pub own_logger: ::std::os::raw::c_int,
    pub last_err: SUNErrCode,
    pub err_handler: SUNErrHandler,
    pub comm: SUNComm,
}
#[test]
fn bindgen_test_layout_SUNContext_() {
    const UNINIT: ::std::mem::MaybeUninit<SUNContext_> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SUNContext_>(),
        48usize,
        concat!("Size of: ", stringify!(SUNContext_))
    );
    assert_eq!(
        ::std::mem::align_of::<SUNContext_>(),
        8usize,
        concat!("Alignment of ", stringify!(SUNContext_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).profiler) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SUNContext_),
            "::",
            stringify!(profiler)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).own_profiler) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SUNContext_),
            "::",
            stringify!(own_profiler)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).logger) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SUNContext_),
            "::",
            stringify!(logger)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).own_logger) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SUNContext_),
            "::",
            stringify!(own_logger)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).last_err) as usize - ptr as usize },
        28usize,
        concat!(
            "Offset of field: ",
            stringify!(SUNContext_),
            "::",
            stringify!(last_err)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).err_handler) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SUNContext_),
            "::",
            stringify!(err_handler)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).comm) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SUNContext_),
            "::",
            stringify!(comm)
        )
    );
}
impl Default for SUNContext_ {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn SUNContext_Create(comm: SUNComm, sunctx_out: *mut SUNContext) -> SUNErrCode;
}
extern "C" {
    pub fn SUNContext_GetLastError(sunctx: SUNContext) -> SUNErrCode;
}
extern "C" {
    pub fn SUNContext_PeekLastError(sunctx: SUNContext) -> SUNErrCode;
}
extern "C" {
    pub fn SUNContext_PushErrHandler(
        sunctx: SUNContext,
        err_fn: SUNErrHandlerFn,
        err_user_data: *mut ::std::os::raw::c_void,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNContext_PopErrHandler(sunctx: SUNContext) -> SUNErrCode;
}
extern "C" {
    pub fn SUNContext_ClearErrHandlers(sunctx: SUNContext) -> SUNErrCode;
}
extern "C" {
    pub fn SUNContext_GetProfiler(sunctx: SUNContext, profiler: *mut SUNProfiler) -> SUNErrCode;
}
extern "C" {
    pub fn SUNContext_SetProfiler(sunctx: SUNContext, profiler: SUNProfiler) -> SUNErrCode;
}
extern "C" {
    pub fn SUNContext_GetLogger(sunctx: SUNContext, logger: *mut SUNLogger) -> SUNErrCode;
}
extern "C" {
    pub fn SUNContext_SetLogger(sunctx: SUNContext, logger: SUNLogger) -> SUNErrCode;
}
extern "C" {
    pub fn SUNContext_Free(ctx: *mut SUNContext) -> SUNErrCode;
}
pub const SUN_ERR_MINIMUM: _bindgen_ty_1 = -10000;
pub const SUN_ERR_ARG_CORRUPT: _bindgen_ty_1 = -9999;
pub const SUN_ERR_ARG_INCOMPATIBLE: _bindgen_ty_1 = -9998;
pub const SUN_ERR_ARG_OUTOFRANGE: _bindgen_ty_1 = -9997;
pub const SUN_ERR_ARG_WRONGTYPE: _bindgen_ty_1 = -9996;
pub const SUN_ERR_ARG_DIMSMISMATCH: _bindgen_ty_1 = -9995;
pub const SUN_ERR_GENERIC: _bindgen_ty_1 = -9994;
pub const SUN_ERR_CORRUPT: _bindgen_ty_1 = -9993;
pub const SUN_ERR_OUTOFRANGE: _bindgen_ty_1 = -9992;
pub const SUN_ERR_FILE_OPEN: _bindgen_ty_1 = -9991;
pub const SUN_ERR_OP_FAIL: _bindgen_ty_1 = -9990;
pub const SUN_ERR_MEM_FAIL: _bindgen_ty_1 = -9989;
pub const SUN_ERR_MALLOC_FAIL: _bindgen_ty_1 = -9988;
pub const SUN_ERR_EXT_FAIL: _bindgen_ty_1 = -9987;
pub const SUN_ERR_DESTROY_FAIL: _bindgen_ty_1 = -9986;
pub const SUN_ERR_NOT_IMPLEMENTED: _bindgen_ty_1 = -9985;
pub const SUN_ERR_USER_FCN_FAIL: _bindgen_ty_1 = -9984;
pub const SUN_ERR_DATANODE_NODENOTFOUND: _bindgen_ty_1 = -9983;
pub const SUN_ERR_PROFILER_MAPFULL: _bindgen_ty_1 = -9982;
pub const SUN_ERR_PROFILER_MAPGET: _bindgen_ty_1 = -9981;
pub const SUN_ERR_PROFILER_MAPINSERT: _bindgen_ty_1 = -9980;
pub const SUN_ERR_PROFILER_MAPKEYNOTFOUND: _bindgen_ty_1 = -9979;
pub const SUN_ERR_PROFILER_MAPSORT: _bindgen_ty_1 = -9978;
pub const SUN_ERR_ADJOINT_STEPPERFAILED: _bindgen_ty_1 = -9977;
pub const SUN_ERR_ADJOINT_STEPPERINVALIDSTOP: _bindgen_ty_1 = -9976;
pub const SUN_ERR_CHECKPOINT_NOT_FOUND: _bindgen_ty_1 = -9975;
pub const SUN_ERR_CHECKPOINT_MISMATCH: _bindgen_ty_1 = -9974;
pub const SUN_ERR_SUNCTX_CORRUPT: _bindgen_ty_1 = -9973;
pub const SUN_ERR_MPI_FAIL: _bindgen_ty_1 = -9972;
pub const SUN_ERR_UNREACHABLE: _bindgen_ty_1 = -9971;
pub const SUN_ERR_UNKNOWN: _bindgen_ty_1 = -9970;
pub const SUN_ERR_MAXIMUM: _bindgen_ty_1 = -1000;
pub const SUN_SUCCESS: _bindgen_ty_1 = 0;
pub type _bindgen_ty_1 = ::std::os::raw::c_int;
extern "C" {
    pub fn SUNLogErrHandlerFn(
        line: ::std::os::raw::c_int,
        func: *const ::std::os::raw::c_char,
        file: *const ::std::os::raw::c_char,
        msg: *const ::std::os::raw::c_char,
        err_code: SUNErrCode,
        err_user_data: *mut ::std::os::raw::c_void,
        sunctx: SUNContext,
    );
}
extern "C" {
    pub fn SUNAbortErrHandlerFn(
        line: ::std::os::raw::c_int,
        func: *const ::std::os::raw::c_char,
        file: *const ::std::os::raw::c_char,
        msg: *const ::std::os::raw::c_char,
        err_code: SUNErrCode,
        err_user_data: *mut ::std::os::raw::c_void,
        sunctx: SUNContext,
    );
}
extern "C" {
    pub fn SUNGetErrMsg(code: SUNErrCode) -> *const ::std::os::raw::c_char;
}
pub const N_Vector_ID_SUNDIALS_NVEC_SERIAL: N_Vector_ID = 0;
pub const N_Vector_ID_SUNDIALS_NVEC_PARALLEL: N_Vector_ID = 1;
pub const N_Vector_ID_SUNDIALS_NVEC_OPENMP: N_Vector_ID = 2;
pub const N_Vector_ID_SUNDIALS_NVEC_PTHREADS: N_Vector_ID = 3;
pub const N_Vector_ID_SUNDIALS_NVEC_PARHYP: N_Vector_ID = 4;
pub const N_Vector_ID_SUNDIALS_NVEC_PETSC: N_Vector_ID = 5;
pub const N_Vector_ID_SUNDIALS_NVEC_CUDA: N_Vector_ID = 6;
pub const N_Vector_ID_SUNDIALS_NVEC_HIP: N_Vector_ID = 7;
pub const N_Vector_ID_SUNDIALS_NVEC_SYCL: N_Vector_ID = 8;
pub const N_Vector_ID_SUNDIALS_NVEC_RAJA: N_Vector_ID = 9;
pub const N_Vector_ID_SUNDIALS_NVEC_KOKKOS: N_Vector_ID = 10;
pub const N_Vector_ID_SUNDIALS_NVEC_OPENMPDEV: N_Vector_ID = 11;
pub const N_Vector_ID_SUNDIALS_NVEC_TRILINOS: N_Vector_ID = 12;
pub const N_Vector_ID_SUNDIALS_NVEC_MANYVECTOR: N_Vector_ID = 13;
pub const N_Vector_ID_SUNDIALS_NVEC_MPIMANYVECTOR: N_Vector_ID = 14;
pub const N_Vector_ID_SUNDIALS_NVEC_MPIPLUSX: N_Vector_ID = 15;
pub const N_Vector_ID_SUNDIALS_NVEC_CUSTOM: N_Vector_ID = 16;
pub type N_Vector_ID = ::std::os::raw::c_uint;
pub type N_Vector_Ops = *mut _generic_N_Vector_Ops;
pub type N_Vector = *mut _generic_N_Vector;
pub type N_Vector_S = *mut N_Vector;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _generic_N_Vector_Ops {
    pub nvgetvectorid: ::std::option::Option<unsafe extern "C" fn(arg1: N_Vector) -> N_Vector_ID>,
    pub nvclone: ::std::option::Option<unsafe extern "C" fn(arg1: N_Vector) -> N_Vector>,
    pub nvcloneempty: ::std::option::Option<unsafe extern "C" fn(arg1: N_Vector) -> N_Vector>,
    pub nvdestroy: ::std::option::Option<unsafe extern "C" fn(arg1: N_Vector)>,
    pub nvspace: ::std::option::Option<
        unsafe extern "C" fn(arg1: N_Vector, arg2: *mut sunindextype, arg3: *mut sunindextype),
    >,
    pub nvgetarraypointer:
        ::std::option::Option<unsafe extern "C" fn(arg1: N_Vector) -> *mut sunrealtype>,
    pub nvgetdevicearraypointer:
        ::std::option::Option<unsafe extern "C" fn(arg1: N_Vector) -> *mut sunrealtype>,
    pub nvsetarraypointer:
        ::std::option::Option<unsafe extern "C" fn(arg1: *mut sunrealtype, arg2: N_Vector)>,
    pub nvgetcommunicator: ::std::option::Option<unsafe extern "C" fn(arg1: N_Vector) -> SUNComm>,
    pub nvgetlength: ::std::option::Option<unsafe extern "C" fn(arg1: N_Vector) -> sunindextype>,
    pub nvgetlocallength:
        ::std::option::Option<unsafe extern "C" fn(arg1: N_Vector) -> sunindextype>,
    pub nvlinearsum: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: sunrealtype,
            arg2: N_Vector,
            arg3: sunrealtype,
            arg4: N_Vector,
            arg5: N_Vector,
        ),
    >,
    pub nvconst: ::std::option::Option<unsafe extern "C" fn(arg1: sunrealtype, arg2: N_Vector)>,
    pub nvprod:
        ::std::option::Option<unsafe extern "C" fn(arg1: N_Vector, arg2: N_Vector, arg3: N_Vector)>,
    pub nvdiv:
        ::std::option::Option<unsafe extern "C" fn(arg1: N_Vector, arg2: N_Vector, arg3: N_Vector)>,
    pub nvscale: ::std::option::Option<
        unsafe extern "C" fn(arg1: sunrealtype, arg2: N_Vector, arg3: N_Vector),
    >,
    pub nvabs: ::std::option::Option<unsafe extern "C" fn(arg1: N_Vector, arg2: N_Vector)>,
    pub nvinv: ::std::option::Option<unsafe extern "C" fn(arg1: N_Vector, arg2: N_Vector)>,
    pub nvaddconst: ::std::option::Option<
        unsafe extern "C" fn(arg1: N_Vector, arg2: sunrealtype, arg3: N_Vector),
    >,
    pub nvdotprod:
        ::std::option::Option<unsafe extern "C" fn(arg1: N_Vector, arg2: N_Vector) -> sunrealtype>,
    pub nvmaxnorm: ::std::option::Option<unsafe extern "C" fn(arg1: N_Vector) -> sunrealtype>,
    pub nvwrmsnorm:
        ::std::option::Option<unsafe extern "C" fn(arg1: N_Vector, arg2: N_Vector) -> sunrealtype>,
    pub nvwrmsnormmask: ::std::option::Option<
        unsafe extern "C" fn(arg1: N_Vector, arg2: N_Vector, arg3: N_Vector) -> sunrealtype,
    >,
    pub nvmin: ::std::option::Option<unsafe extern "C" fn(arg1: N_Vector) -> sunrealtype>,
    pub nvwl2norm:
        ::std::option::Option<unsafe extern "C" fn(arg1: N_Vector, arg2: N_Vector) -> sunrealtype>,
    pub nvl1norm: ::std::option::Option<unsafe extern "C" fn(arg1: N_Vector) -> sunrealtype>,
    pub nvcompare: ::std::option::Option<
        unsafe extern "C" fn(arg1: sunrealtype, arg2: N_Vector, arg3: N_Vector),
    >,
    pub nvinvtest: ::std::option::Option<
        unsafe extern "C" fn(arg1: N_Vector, arg2: N_Vector) -> ::std::os::raw::c_int,
    >,
    pub nvconstrmask: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: N_Vector,
            arg2: N_Vector,
            arg3: N_Vector,
        ) -> ::std::os::raw::c_int,
    >,
    pub nvminquotient:
        ::std::option::Option<unsafe extern "C" fn(arg1: N_Vector, arg2: N_Vector) -> sunrealtype>,
    pub nvlinearcombination: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: ::std::os::raw::c_int,
            arg2: *mut sunrealtype,
            arg3: *mut N_Vector,
            arg4: N_Vector,
        ) -> SUNErrCode,
    >,
    pub nvscaleaddmulti: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: ::std::os::raw::c_int,
            arg2: *mut sunrealtype,
            arg3: N_Vector,
            arg4: *mut N_Vector,
            arg5: *mut N_Vector,
        ) -> SUNErrCode,
    >,
    pub nvdotprodmulti: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: ::std::os::raw::c_int,
            arg2: N_Vector,
            arg3: *mut N_Vector,
            arg4: *mut sunrealtype,
        ) -> SUNErrCode,
    >,
    pub nvlinearsumvectorarray: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: ::std::os::raw::c_int,
            arg2: sunrealtype,
            arg3: *mut N_Vector,
            arg4: sunrealtype,
            arg5: *mut N_Vector,
            arg6: *mut N_Vector,
        ) -> SUNErrCode,
    >,
    pub nvscalevectorarray: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: ::std::os::raw::c_int,
            arg2: *mut sunrealtype,
            arg3: *mut N_Vector,
            arg4: *mut N_Vector,
        ) -> SUNErrCode,
    >,
    pub nvconstvectorarray: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: ::std::os::raw::c_int,
            arg2: sunrealtype,
            arg3: *mut N_Vector,
        ) -> SUNErrCode,
    >,
    pub nvwrmsnormvectorarray: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: ::std::os::raw::c_int,
            arg2: *mut N_Vector,
            arg3: *mut N_Vector,
            arg4: *mut sunrealtype,
        ) -> SUNErrCode,
    >,
    pub nvwrmsnormmaskvectorarray: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: ::std::os::raw::c_int,
            arg2: *mut N_Vector,
            arg3: *mut N_Vector,
            arg4: N_Vector,
            arg5: *mut sunrealtype,
        ) -> SUNErrCode,
    >,
    pub nvscaleaddmultivectorarray: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: ::std::os::raw::c_int,
            arg2: ::std::os::raw::c_int,
            arg3: *mut sunrealtype,
            arg4: *mut N_Vector,
            arg5: *mut *mut N_Vector,
            arg6: *mut *mut N_Vector,
        ) -> SUNErrCode,
    >,
    pub nvlinearcombinationvectorarray: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: ::std::os::raw::c_int,
            arg2: ::std::os::raw::c_int,
            arg3: *mut sunrealtype,
            arg4: *mut *mut N_Vector,
            arg5: *mut N_Vector,
        ) -> SUNErrCode,
    >,
    pub nvdotprodlocal:
        ::std::option::Option<unsafe extern "C" fn(arg1: N_Vector, arg2: N_Vector) -> sunrealtype>,
    pub nvmaxnormlocal: ::std::option::Option<unsafe extern "C" fn(arg1: N_Vector) -> sunrealtype>,
    pub nvminlocal: ::std::option::Option<unsafe extern "C" fn(arg1: N_Vector) -> sunrealtype>,
    pub nvl1normlocal: ::std::option::Option<unsafe extern "C" fn(arg1: N_Vector) -> sunrealtype>,
    pub nvinvtestlocal: ::std::option::Option<
        unsafe extern "C" fn(arg1: N_Vector, arg2: N_Vector) -> ::std::os::raw::c_int,
    >,
    pub nvconstrmasklocal: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: N_Vector,
            arg2: N_Vector,
            arg3: N_Vector,
        ) -> ::std::os::raw::c_int,
    >,
    pub nvminquotientlocal:
        ::std::option::Option<unsafe extern "C" fn(arg1: N_Vector, arg2: N_Vector) -> sunrealtype>,
    pub nvwsqrsumlocal:
        ::std::option::Option<unsafe extern "C" fn(arg1: N_Vector, arg2: N_Vector) -> sunrealtype>,
    pub nvwsqrsummasklocal: ::std::option::Option<
        unsafe extern "C" fn(arg1: N_Vector, arg2: N_Vector, arg3: N_Vector) -> sunrealtype,
    >,
    pub nvdotprodmultilocal: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: ::std::os::raw::c_int,
            arg2: N_Vector,
            arg3: *mut N_Vector,
            arg4: *mut sunrealtype,
        ) -> SUNErrCode,
    >,
    pub nvdotprodmultiallreduce: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: ::std::os::raw::c_int,
            arg2: N_Vector,
            arg3: *mut sunrealtype,
        ) -> SUNErrCode,
    >,
    pub nvbufsize: ::std::option::Option<
        unsafe extern "C" fn(arg1: N_Vector, arg2: *mut sunindextype) -> SUNErrCode,
    >,
    pub nvbufpack: ::std::option::Option<
        unsafe extern "C" fn(arg1: N_Vector, arg2: *mut ::std::os::raw::c_void) -> SUNErrCode,
    >,
    pub nvbufunpack: ::std::option::Option<
        unsafe extern "C" fn(arg1: N_Vector, arg2: *mut ::std::os::raw::c_void) -> SUNErrCode,
    >,
    pub nvprint: ::std::option::Option<unsafe extern "C" fn(arg1: N_Vector)>,
    pub nvprintfile: ::std::option::Option<unsafe extern "C" fn(arg1: N_Vector, arg2: *mut FILE)>,
}
#[test]
fn bindgen_test_layout__generic_N_Vector_Ops() {
    const UNINIT: ::std::mem::MaybeUninit<_generic_N_Vector_Ops> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_generic_N_Vector_Ops>(),
        448usize,
        concat!("Size of: ", stringify!(_generic_N_Vector_Ops))
    );
    assert_eq!(
        ::std::mem::align_of::<_generic_N_Vector_Ops>(),
        8usize,
        concat!("Alignment of ", stringify!(_generic_N_Vector_Ops))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvgetvectorid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvgetvectorid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvclone) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvclone)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvcloneempty) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvcloneempty)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvdestroy) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvdestroy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvspace) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvspace)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvgetarraypointer) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvgetarraypointer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvgetdevicearraypointer) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvgetdevicearraypointer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvsetarraypointer) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvsetarraypointer)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvgetcommunicator) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvgetcommunicator)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvgetlength) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvgetlength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvgetlocallength) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvgetlocallength)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvlinearsum) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvlinearsum)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvconst) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvconst)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvprod) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvprod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvdiv) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvdiv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvscale) as usize - ptr as usize },
        120usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvscale)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvabs) as usize - ptr as usize },
        128usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvabs)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvinv) as usize - ptr as usize },
        136usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvinv)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvaddconst) as usize - ptr as usize },
        144usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvaddconst)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvdotprod) as usize - ptr as usize },
        152usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvdotprod)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvmaxnorm) as usize - ptr as usize },
        160usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvmaxnorm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvwrmsnorm) as usize - ptr as usize },
        168usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvwrmsnorm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvwrmsnormmask) as usize - ptr as usize },
        176usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvwrmsnormmask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvmin) as usize - ptr as usize },
        184usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvmin)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvwl2norm) as usize - ptr as usize },
        192usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvwl2norm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvl1norm) as usize - ptr as usize },
        200usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvl1norm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvcompare) as usize - ptr as usize },
        208usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvcompare)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvinvtest) as usize - ptr as usize },
        216usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvinvtest)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvconstrmask) as usize - ptr as usize },
        224usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvconstrmask)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvminquotient) as usize - ptr as usize },
        232usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvminquotient)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvlinearcombination) as usize - ptr as usize },
        240usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvlinearcombination)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvscaleaddmulti) as usize - ptr as usize },
        248usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvscaleaddmulti)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvdotprodmulti) as usize - ptr as usize },
        256usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvdotprodmulti)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvlinearsumvectorarray) as usize - ptr as usize },
        264usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvlinearsumvectorarray)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvscalevectorarray) as usize - ptr as usize },
        272usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvscalevectorarray)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvconstvectorarray) as usize - ptr as usize },
        280usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvconstvectorarray)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvwrmsnormvectorarray) as usize - ptr as usize },
        288usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvwrmsnormvectorarray)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvwrmsnormmaskvectorarray) as usize - ptr as usize },
        296usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvwrmsnormmaskvectorarray)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvscaleaddmultivectorarray) as usize - ptr as usize },
        304usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvscaleaddmultivectorarray)
        )
    );
    assert_eq!(
        unsafe {
            ::std::ptr::addr_of!((*ptr).nvlinearcombinationvectorarray) as usize - ptr as usize
        },
        312usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvlinearcombinationvectorarray)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvdotprodlocal) as usize - ptr as usize },
        320usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvdotprodlocal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvmaxnormlocal) as usize - ptr as usize },
        328usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvmaxnormlocal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvminlocal) as usize - ptr as usize },
        336usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvminlocal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvl1normlocal) as usize - ptr as usize },
        344usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvl1normlocal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvinvtestlocal) as usize - ptr as usize },
        352usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvinvtestlocal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvconstrmasklocal) as usize - ptr as usize },
        360usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvconstrmasklocal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvminquotientlocal) as usize - ptr as usize },
        368usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvminquotientlocal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvwsqrsumlocal) as usize - ptr as usize },
        376usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvwsqrsumlocal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvwsqrsummasklocal) as usize - ptr as usize },
        384usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvwsqrsummasklocal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvdotprodmultilocal) as usize - ptr as usize },
        392usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvdotprodmultilocal)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvdotprodmultiallreduce) as usize - ptr as usize },
        400usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvdotprodmultiallreduce)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvbufsize) as usize - ptr as usize },
        408usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvbufsize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvbufpack) as usize - ptr as usize },
        416usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvbufpack)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvbufunpack) as usize - ptr as usize },
        424usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvbufunpack)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvprint) as usize - ptr as usize },
        432usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvprint)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nvprintfile) as usize - ptr as usize },
        440usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector_Ops),
            "::",
            stringify!(nvprintfile)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _generic_N_Vector {
    pub content: *mut ::std::os::raw::c_void,
    pub ops: N_Vector_Ops,
    pub sunctx: SUNContext,
}
#[test]
fn bindgen_test_layout__generic_N_Vector() {
    const UNINIT: ::std::mem::MaybeUninit<_generic_N_Vector> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_generic_N_Vector>(),
        24usize,
        concat!("Size of: ", stringify!(_generic_N_Vector))
    );
    assert_eq!(
        ::std::mem::align_of::<_generic_N_Vector>(),
        8usize,
        concat!("Alignment of ", stringify!(_generic_N_Vector))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).content) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector),
            "::",
            stringify!(content)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ops) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector),
            "::",
            stringify!(ops)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sunctx) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_N_Vector),
            "::",
            stringify!(sunctx)
        )
    );
}
impl Default for _generic_N_Vector {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn N_VNewEmpty(sunctx: SUNContext) -> N_Vector;
}
extern "C" {
    pub fn N_VFreeEmpty(v: N_Vector);
}
extern "C" {
    pub fn N_VCopyOps(w: N_Vector, v: N_Vector) -> SUNErrCode;
}
extern "C" {
    pub fn N_VGetVectorID(w: N_Vector) -> N_Vector_ID;
}
extern "C" {
    pub fn N_VClone(w: N_Vector) -> N_Vector;
}
extern "C" {
    pub fn N_VCloneEmpty(w: N_Vector) -> N_Vector;
}
extern "C" {
    pub fn N_VDestroy(v: N_Vector);
}
extern "C" {
    pub fn N_VSpace(v: N_Vector, lrw: *mut sunindextype, liw: *mut sunindextype);
}
extern "C" {
    pub fn N_VGetArrayPointer(v: N_Vector) -> *mut sunrealtype;
}
extern "C" {
    pub fn N_VGetDeviceArrayPointer(v: N_Vector) -> *mut sunrealtype;
}
extern "C" {
    pub fn N_VSetArrayPointer(v_data: *mut sunrealtype, v: N_Vector);
}
extern "C" {
    pub fn N_VGetCommunicator(v: N_Vector) -> SUNComm;
}
extern "C" {
    pub fn N_VGetLength(v: N_Vector) -> sunindextype;
}
extern "C" {
    pub fn N_VGetLocalLength(v: N_Vector) -> sunindextype;
}
extern "C" {
    pub fn N_VLinearSum(a: sunrealtype, x: N_Vector, b: sunrealtype, y: N_Vector, z: N_Vector);
}
extern "C" {
    pub fn N_VConst(c: sunrealtype, z: N_Vector);
}
extern "C" {
    pub fn N_VProd(x: N_Vector, y: N_Vector, z: N_Vector);
}
extern "C" {
    pub fn N_VDiv(x: N_Vector, y: N_Vector, z: N_Vector);
}
extern "C" {
    pub fn N_VScale(c: sunrealtype, x: N_Vector, z: N_Vector);
}
extern "C" {
    pub fn N_VAbs(x: N_Vector, z: N_Vector);
}
extern "C" {
    pub fn N_VInv(x: N_Vector, z: N_Vector);
}
extern "C" {
    pub fn N_VAddConst(x: N_Vector, b: sunrealtype, z: N_Vector);
}
extern "C" {
    pub fn N_VDotProd(x: N_Vector, y: N_Vector) -> sunrealtype;
}
extern "C" {
    pub fn N_VMaxNorm(x: N_Vector) -> sunrealtype;
}
extern "C" {
    pub fn N_VWrmsNorm(x: N_Vector, w: N_Vector) -> sunrealtype;
}
extern "C" {
    pub fn N_VWrmsNormMask(x: N_Vector, w: N_Vector, id: N_Vector) -> sunrealtype;
}
extern "C" {
    pub fn N_VMin(x: N_Vector) -> sunrealtype;
}
extern "C" {
    pub fn N_VWL2Norm(x: N_Vector, w: N_Vector) -> sunrealtype;
}
extern "C" {
    pub fn N_VL1Norm(x: N_Vector) -> sunrealtype;
}
extern "C" {
    pub fn N_VCompare(c: sunrealtype, x: N_Vector, z: N_Vector);
}
extern "C" {
    pub fn N_VInvTest(x: N_Vector, z: N_Vector) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn N_VConstrMask(c: N_Vector, x: N_Vector, m: N_Vector) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn N_VMinQuotient(num: N_Vector, denom: N_Vector) -> sunrealtype;
}
extern "C" {
    pub fn N_VLinearCombination(
        nvec: ::std::os::raw::c_int,
        c: *mut sunrealtype,
        X: *mut N_Vector,
        z: N_Vector,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn N_VScaleAddMulti(
        nvec: ::std::os::raw::c_int,
        a: *mut sunrealtype,
        x: N_Vector,
        Y: *mut N_Vector,
        Z: *mut N_Vector,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn N_VDotProdMulti(
        nvec: ::std::os::raw::c_int,
        x: N_Vector,
        Y: *mut N_Vector,
        dotprods: *mut sunrealtype,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn N_VLinearSumVectorArray(
        nvec: ::std::os::raw::c_int,
        a: sunrealtype,
        X: *mut N_Vector,
        b: sunrealtype,
        Y: *mut N_Vector,
        Z: *mut N_Vector,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn N_VScaleVectorArray(
        nvec: ::std::os::raw::c_int,
        c: *mut sunrealtype,
        X: *mut N_Vector,
        Z: *mut N_Vector,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn N_VConstVectorArray(
        nvec: ::std::os::raw::c_int,
        c: sunrealtype,
        Z: *mut N_Vector,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn N_VWrmsNormVectorArray(
        nvec: ::std::os::raw::c_int,
        X: *mut N_Vector,
        W: *mut N_Vector,
        nrm: *mut sunrealtype,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn N_VWrmsNormMaskVectorArray(
        nvec: ::std::os::raw::c_int,
        X: *mut N_Vector,
        W: *mut N_Vector,
        id: N_Vector,
        nrm: *mut sunrealtype,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn N_VScaleAddMultiVectorArray(
        nvec: ::std::os::raw::c_int,
        nsum: ::std::os::raw::c_int,
        a: *mut sunrealtype,
        X: *mut N_Vector,
        Y: *mut *mut N_Vector,
        Z: *mut *mut N_Vector,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn N_VLinearCombinationVectorArray(
        nvec: ::std::os::raw::c_int,
        nsum: ::std::os::raw::c_int,
        c: *mut sunrealtype,
        X: *mut *mut N_Vector,
        Z: *mut N_Vector,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn N_VDotProdLocal(x: N_Vector, y: N_Vector) -> sunrealtype;
}
extern "C" {
    pub fn N_VMaxNormLocal(x: N_Vector) -> sunrealtype;
}
extern "C" {
    pub fn N_VMinLocal(x: N_Vector) -> sunrealtype;
}
extern "C" {
    pub fn N_VL1NormLocal(x: N_Vector) -> sunrealtype;
}
extern "C" {
    pub fn N_VWSqrSumLocal(x: N_Vector, w: N_Vector) -> sunrealtype;
}
extern "C" {
    pub fn N_VWSqrSumMaskLocal(x: N_Vector, w: N_Vector, id: N_Vector) -> sunrealtype;
}
extern "C" {
    pub fn N_VInvTestLocal(x: N_Vector, z: N_Vector) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn N_VConstrMaskLocal(c: N_Vector, x: N_Vector, m: N_Vector) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn N_VMinQuotientLocal(num: N_Vector, denom: N_Vector) -> sunrealtype;
}
extern "C" {
    pub fn N_VDotProdMultiLocal(
        nvec: ::std::os::raw::c_int,
        x: N_Vector,
        Y: *mut N_Vector,
        dotprods: *mut sunrealtype,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn N_VDotProdMultiAllReduce(
        nvec_total: ::std::os::raw::c_int,
        x: N_Vector,
        sum: *mut sunrealtype,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn N_VBufSize(x: N_Vector, size: *mut sunindextype) -> SUNErrCode;
}
extern "C" {
    pub fn N_VBufPack(x: N_Vector, buf: *mut ::std::os::raw::c_void) -> SUNErrCode;
}
extern "C" {
    pub fn N_VBufUnpack(x: N_Vector, buf: *mut ::std::os::raw::c_void) -> SUNErrCode;
}
extern "C" {
    pub fn N_VNewVectorArray(count: ::std::os::raw::c_int, sunctx: SUNContext) -> *mut N_Vector;
}
extern "C" {
    pub fn N_VCloneEmptyVectorArray(count: ::std::os::raw::c_int, w: N_Vector) -> *mut N_Vector;
}
extern "C" {
    pub fn N_VCloneVectorArray(count: ::std::os::raw::c_int, w: N_Vector) -> *mut N_Vector;
}
extern "C" {
    pub fn N_VDestroyVectorArray(vs: *mut N_Vector, count: ::std::os::raw::c_int);
}
extern "C" {
    pub fn N_VGetVecAtIndexVectorArray(vs: *mut N_Vector, index: ::std::os::raw::c_int)
        -> N_Vector;
}
extern "C" {
    pub fn N_VSetVecAtIndexVectorArray(
        vs: *mut N_Vector,
        index: ::std::os::raw::c_int,
        w: N_Vector,
    );
}
extern "C" {
    pub fn N_VPrint(v: N_Vector);
}
extern "C" {
    pub fn N_VPrintFile(v: N_Vector, outfile: *mut FILE);
}
pub const SUNMatrix_ID_SUNMATRIX_DENSE: SUNMatrix_ID = 0;
pub const SUNMatrix_ID_SUNMATRIX_MAGMADENSE: SUNMatrix_ID = 1;
pub const SUNMatrix_ID_SUNMATRIX_ONEMKLDENSE: SUNMatrix_ID = 2;
pub const SUNMatrix_ID_SUNMATRIX_BAND: SUNMatrix_ID = 3;
pub const SUNMatrix_ID_SUNMATRIX_SPARSE: SUNMatrix_ID = 4;
pub const SUNMatrix_ID_SUNMATRIX_SLUNRLOC: SUNMatrix_ID = 5;
pub const SUNMatrix_ID_SUNMATRIX_CUSPARSE: SUNMatrix_ID = 6;
pub const SUNMatrix_ID_SUNMATRIX_GINKGO: SUNMatrix_ID = 7;
pub const SUNMatrix_ID_SUNMATRIX_KOKKOSDENSE: SUNMatrix_ID = 8;
pub const SUNMatrix_ID_SUNMATRIX_CUSTOM: SUNMatrix_ID = 9;
pub type SUNMatrix_ID = ::std::os::raw::c_uint;
pub type SUNMatrix_Ops = *mut _generic_SUNMatrix_Ops;
pub type SUNMatrix = *mut _generic_SUNMatrix;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _generic_SUNMatrix_Ops {
    pub getid: ::std::option::Option<unsafe extern "C" fn(arg1: SUNMatrix) -> SUNMatrix_ID>,
    pub clone: ::std::option::Option<unsafe extern "C" fn(arg1: SUNMatrix) -> SUNMatrix>,
    pub destroy: ::std::option::Option<unsafe extern "C" fn(arg1: SUNMatrix)>,
    pub zero: ::std::option::Option<unsafe extern "C" fn(arg1: SUNMatrix) -> SUNErrCode>,
    pub copy:
        ::std::option::Option<unsafe extern "C" fn(arg1: SUNMatrix, arg2: SUNMatrix) -> SUNErrCode>,
    pub scaleadd: ::std::option::Option<
        unsafe extern "C" fn(arg1: sunrealtype, arg2: SUNMatrix, arg3: SUNMatrix) -> SUNErrCode,
    >,
    pub scaleaddi: ::std::option::Option<
        unsafe extern "C" fn(arg1: sunrealtype, arg2: SUNMatrix) -> SUNErrCode,
    >,
    pub matvecsetup: ::std::option::Option<unsafe extern "C" fn(arg1: SUNMatrix) -> SUNErrCode>,
    pub matvec: ::std::option::Option<
        unsafe extern "C" fn(arg1: SUNMatrix, arg2: N_Vector, arg3: N_Vector) -> SUNErrCode,
    >,
    pub mathermitiantransposevec: ::std::option::Option<
        unsafe extern "C" fn(arg1: SUNMatrix, arg2: N_Vector, arg3: N_Vector) -> SUNErrCode,
    >,
    pub space: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: SUNMatrix,
            arg2: *mut ::std::os::raw::c_long,
            arg3: *mut ::std::os::raw::c_long,
        ) -> SUNErrCode,
    >,
}
#[test]
fn bindgen_test_layout__generic_SUNMatrix_Ops() {
    const UNINIT: ::std::mem::MaybeUninit<_generic_SUNMatrix_Ops> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_generic_SUNMatrix_Ops>(),
        88usize,
        concat!("Size of: ", stringify!(_generic_SUNMatrix_Ops))
    );
    assert_eq!(
        ::std::mem::align_of::<_generic_SUNMatrix_Ops>(),
        8usize,
        concat!("Alignment of ", stringify!(_generic_SUNMatrix_Ops))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getid) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNMatrix_Ops),
            "::",
            stringify!(getid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clone) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNMatrix_Ops),
            "::",
            stringify!(clone)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).destroy) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNMatrix_Ops),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).zero) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNMatrix_Ops),
            "::",
            stringify!(zero)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).copy) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNMatrix_Ops),
            "::",
            stringify!(copy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scaleadd) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNMatrix_Ops),
            "::",
            stringify!(scaleadd)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).scaleaddi) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNMatrix_Ops),
            "::",
            stringify!(scaleaddi)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).matvecsetup) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNMatrix_Ops),
            "::",
            stringify!(matvecsetup)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).matvec) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNMatrix_Ops),
            "::",
            stringify!(matvec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mathermitiantransposevec) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNMatrix_Ops),
            "::",
            stringify!(mathermitiantransposevec)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).space) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNMatrix_Ops),
            "::",
            stringify!(space)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _generic_SUNMatrix {
    pub content: *mut ::std::os::raw::c_void,
    pub ops: SUNMatrix_Ops,
    pub sunctx: SUNContext,
}
#[test]
fn bindgen_test_layout__generic_SUNMatrix() {
    const UNINIT: ::std::mem::MaybeUninit<_generic_SUNMatrix> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_generic_SUNMatrix>(),
        24usize,
        concat!("Size of: ", stringify!(_generic_SUNMatrix))
    );
    assert_eq!(
        ::std::mem::align_of::<_generic_SUNMatrix>(),
        8usize,
        concat!("Alignment of ", stringify!(_generic_SUNMatrix))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).content) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNMatrix),
            "::",
            stringify!(content)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ops) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNMatrix),
            "::",
            stringify!(ops)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sunctx) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNMatrix),
            "::",
            stringify!(sunctx)
        )
    );
}
impl Default for _generic_SUNMatrix {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn SUNMatNewEmpty(sunctx: SUNContext) -> SUNMatrix;
}
extern "C" {
    pub fn SUNMatFreeEmpty(A: SUNMatrix);
}
extern "C" {
    pub fn SUNMatCopyOps(A: SUNMatrix, B: SUNMatrix) -> SUNErrCode;
}
extern "C" {
    pub fn SUNMatGetID(A: SUNMatrix) -> SUNMatrix_ID;
}
extern "C" {
    pub fn SUNMatClone(A: SUNMatrix) -> SUNMatrix;
}
extern "C" {
    pub fn SUNMatDestroy(A: SUNMatrix);
}
extern "C" {
    pub fn SUNMatZero(A: SUNMatrix) -> SUNErrCode;
}
extern "C" {
    pub fn SUNMatCopy(A: SUNMatrix, B: SUNMatrix) -> SUNErrCode;
}
extern "C" {
    pub fn SUNMatScaleAdd(c: sunrealtype, A: SUNMatrix, B: SUNMatrix) -> SUNErrCode;
}
extern "C" {
    pub fn SUNMatScaleAddI(c: sunrealtype, A: SUNMatrix) -> SUNErrCode;
}
extern "C" {
    pub fn SUNMatMatvecSetup(A: SUNMatrix) -> SUNErrCode;
}
extern "C" {
    pub fn SUNMatMatvec(A: SUNMatrix, x: N_Vector, y: N_Vector) -> SUNErrCode;
}
extern "C" {
    pub fn SUNMatHermitianTransposeVec(A: SUNMatrix, x: N_Vector, y: N_Vector) -> SUNErrCode;
}
extern "C" {
    pub fn SUNMatSpace(
        A: SUNMatrix,
        lenrw: *mut ::std::os::raw::c_long,
        leniw: *mut ::std::os::raw::c_long,
    ) -> SUNErrCode;
}
pub const SUN_PREC_NONE: _bindgen_ty_2 = 0;
pub const SUN_PREC_LEFT: _bindgen_ty_2 = 1;
pub const SUN_PREC_RIGHT: _bindgen_ty_2 = 2;
pub const SUN_PREC_BOTH: _bindgen_ty_2 = 3;
pub type _bindgen_ty_2 = ::std::os::raw::c_uint;
pub const SUN_MODIFIED_GS: _bindgen_ty_3 = 1;
pub const SUN_CLASSICAL_GS: _bindgen_ty_3 = 2;
pub type _bindgen_ty_3 = ::std::os::raw::c_uint;
pub type SUNATimesFn = ::std::option::Option<
    unsafe extern "C" fn(
        A_data: *mut ::std::os::raw::c_void,
        v: N_Vector,
        z: N_Vector,
    ) -> ::std::os::raw::c_int,
>;
pub type SUNPSetupFn = ::std::option::Option<
    unsafe extern "C" fn(P_data: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
pub type SUNPSolveFn = ::std::option::Option<
    unsafe extern "C" fn(
        P_data: *mut ::std::os::raw::c_void,
        r: N_Vector,
        z: N_Vector,
        tol: sunrealtype,
        lr: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int,
>;
pub type SUNQRAddFn = ::std::option::Option<
    unsafe extern "C" fn(
        Q: *mut N_Vector,
        R: *mut sunrealtype,
        f: N_Vector,
        m: ::std::os::raw::c_int,
        mMax: ::std::os::raw::c_int,
        QR_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn SUNModifiedGS(
        v: *mut N_Vector,
        h: *mut *mut sunrealtype,
        k: ::std::os::raw::c_int,
        p: ::std::os::raw::c_int,
        new_vk_norm: *mut sunrealtype,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNClassicalGS(
        v: *mut N_Vector,
        h: *mut *mut sunrealtype,
        k: ::std::os::raw::c_int,
        p: ::std::os::raw::c_int,
        new_vk_norm: *mut sunrealtype,
        stemp: *mut sunrealtype,
        vtemp: *mut N_Vector,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNQRfact(
        n: ::std::os::raw::c_int,
        h: *mut *mut sunrealtype,
        q: *mut sunrealtype,
        job: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SUNQRsol(
        n: ::std::os::raw::c_int,
        h: *mut *mut sunrealtype,
        q: *mut sunrealtype,
        b: *mut sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SUNQRAdd_MGS(
        Q: *mut N_Vector,
        R: *mut sunrealtype,
        df: N_Vector,
        m: ::std::os::raw::c_int,
        mMax: ::std::os::raw::c_int,
        QRdata: *mut ::std::os::raw::c_void,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNQRAdd_ICWY(
        Q: *mut N_Vector,
        R: *mut sunrealtype,
        df: N_Vector,
        m: ::std::os::raw::c_int,
        mMax: ::std::os::raw::c_int,
        QRdata: *mut ::std::os::raw::c_void,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNQRAdd_ICWY_SB(
        Q: *mut N_Vector,
        R: *mut sunrealtype,
        df: N_Vector,
        m: ::std::os::raw::c_int,
        mMax: ::std::os::raw::c_int,
        QRdata: *mut ::std::os::raw::c_void,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNQRAdd_CGS2(
        Q: *mut N_Vector,
        R: *mut sunrealtype,
        df: N_Vector,
        m: ::std::os::raw::c_int,
        mMax: ::std::os::raw::c_int,
        QRdata: *mut ::std::os::raw::c_void,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNQRAdd_DCGS2(
        Q: *mut N_Vector,
        R: *mut sunrealtype,
        df: N_Vector,
        m: ::std::os::raw::c_int,
        mMax: ::std::os::raw::c_int,
        QRdata: *mut ::std::os::raw::c_void,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNQRAdd_DCGS2_SB(
        Q: *mut N_Vector,
        R: *mut sunrealtype,
        df: N_Vector,
        m: ::std::os::raw::c_int,
        mMax: ::std::os::raw::c_int,
        QRdata: *mut ::std::os::raw::c_void,
    ) -> SUNErrCode;
}
pub const SUNLinearSolver_Type_SUNLINEARSOLVER_DIRECT: SUNLinearSolver_Type = 0;
pub const SUNLinearSolver_Type_SUNLINEARSOLVER_ITERATIVE: SUNLinearSolver_Type = 1;
pub const SUNLinearSolver_Type_SUNLINEARSOLVER_MATRIX_ITERATIVE: SUNLinearSolver_Type = 2;
pub const SUNLinearSolver_Type_SUNLINEARSOLVER_MATRIX_EMBEDDED: SUNLinearSolver_Type = 3;
pub type SUNLinearSolver_Type = ::std::os::raw::c_uint;
pub const SUNLinearSolver_ID_SUNLINEARSOLVER_BAND: SUNLinearSolver_ID = 0;
pub const SUNLinearSolver_ID_SUNLINEARSOLVER_DENSE: SUNLinearSolver_ID = 1;
pub const SUNLinearSolver_ID_SUNLINEARSOLVER_KLU: SUNLinearSolver_ID = 2;
pub const SUNLinearSolver_ID_SUNLINEARSOLVER_LAPACKBAND: SUNLinearSolver_ID = 3;
pub const SUNLinearSolver_ID_SUNLINEARSOLVER_LAPACKDENSE: SUNLinearSolver_ID = 4;
pub const SUNLinearSolver_ID_SUNLINEARSOLVER_PCG: SUNLinearSolver_ID = 5;
pub const SUNLinearSolver_ID_SUNLINEARSOLVER_SPBCGS: SUNLinearSolver_ID = 6;
pub const SUNLinearSolver_ID_SUNLINEARSOLVER_SPFGMR: SUNLinearSolver_ID = 7;
pub const SUNLinearSolver_ID_SUNLINEARSOLVER_SPGMR: SUNLinearSolver_ID = 8;
pub const SUNLinearSolver_ID_SUNLINEARSOLVER_SPTFQMR: SUNLinearSolver_ID = 9;
pub const SUNLinearSolver_ID_SUNLINEARSOLVER_SUPERLUDIST: SUNLinearSolver_ID = 10;
pub const SUNLinearSolver_ID_SUNLINEARSOLVER_SUPERLUMT: SUNLinearSolver_ID = 11;
pub const SUNLinearSolver_ID_SUNLINEARSOLVER_CUSOLVERSP_BATCHQR: SUNLinearSolver_ID = 12;
pub const SUNLinearSolver_ID_SUNLINEARSOLVER_MAGMADENSE: SUNLinearSolver_ID = 13;
pub const SUNLinearSolver_ID_SUNLINEARSOLVER_ONEMKLDENSE: SUNLinearSolver_ID = 14;
pub const SUNLinearSolver_ID_SUNLINEARSOLVER_GINKGO: SUNLinearSolver_ID = 15;
pub const SUNLinearSolver_ID_SUNLINEARSOLVER_KOKKOSDENSE: SUNLinearSolver_ID = 16;
pub const SUNLinearSolver_ID_SUNLINEARSOLVER_CUSTOM: SUNLinearSolver_ID = 17;
pub type SUNLinearSolver_ID = ::std::os::raw::c_uint;
pub type SUNLinearSolver_Ops = *mut _generic_SUNLinearSolver_Ops;
pub type SUNLinearSolver = *mut _generic_SUNLinearSolver;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _generic_SUNLinearSolver_Ops {
    pub gettype:
        ::std::option::Option<unsafe extern "C" fn(arg1: SUNLinearSolver) -> SUNLinearSolver_Type>,
    pub getid:
        ::std::option::Option<unsafe extern "C" fn(arg1: SUNLinearSolver) -> SUNLinearSolver_ID>,
    pub setatimes: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: SUNLinearSolver,
            arg2: *mut ::std::os::raw::c_void,
            arg3: SUNATimesFn,
        ) -> SUNErrCode,
    >,
    pub setpreconditioner: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: SUNLinearSolver,
            arg2: *mut ::std::os::raw::c_void,
            arg3: SUNPSetupFn,
            arg4: SUNPSolveFn,
        ) -> SUNErrCode,
    >,
    pub setscalingvectors: ::std::option::Option<
        unsafe extern "C" fn(arg1: SUNLinearSolver, arg2: N_Vector, arg3: N_Vector) -> SUNErrCode,
    >,
    pub setzeroguess: ::std::option::Option<
        unsafe extern "C" fn(arg1: SUNLinearSolver, arg2: ::std::os::raw::c_int) -> SUNErrCode,
    >,
    pub initialize:
        ::std::option::Option<unsafe extern "C" fn(arg1: SUNLinearSolver) -> SUNErrCode>,
    pub setup: ::std::option::Option<
        unsafe extern "C" fn(arg1: SUNLinearSolver, arg2: SUNMatrix) -> ::std::os::raw::c_int,
    >,
    pub solve: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: SUNLinearSolver,
            arg2: SUNMatrix,
            arg3: N_Vector,
            arg4: N_Vector,
            arg5: sunrealtype,
        ) -> ::std::os::raw::c_int,
    >,
    pub numiters:
        ::std::option::Option<unsafe extern "C" fn(arg1: SUNLinearSolver) -> ::std::os::raw::c_int>,
    pub resnorm: ::std::option::Option<unsafe extern "C" fn(arg1: SUNLinearSolver) -> sunrealtype>,
    pub lastflag:
        ::std::option::Option<unsafe extern "C" fn(arg1: SUNLinearSolver) -> sunindextype>,
    pub space: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: SUNLinearSolver,
            arg2: *mut ::std::os::raw::c_long,
            arg3: *mut ::std::os::raw::c_long,
        ) -> SUNErrCode,
    >,
    pub resid: ::std::option::Option<unsafe extern "C" fn(arg1: SUNLinearSolver) -> N_Vector>,
    pub free: ::std::option::Option<unsafe extern "C" fn(arg1: SUNLinearSolver) -> SUNErrCode>,
}
#[test]
fn bindgen_test_layout__generic_SUNLinearSolver_Ops() {
    const UNINIT: ::std::mem::MaybeUninit<_generic_SUNLinearSolver_Ops> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_generic_SUNLinearSolver_Ops>(),
        120usize,
        concat!("Size of: ", stringify!(_generic_SUNLinearSolver_Ops))
    );
    assert_eq!(
        ::std::mem::align_of::<_generic_SUNLinearSolver_Ops>(),
        8usize,
        concat!("Alignment of ", stringify!(_generic_SUNLinearSolver_Ops))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gettype) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNLinearSolver_Ops),
            "::",
            stringify!(gettype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getid) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNLinearSolver_Ops),
            "::",
            stringify!(getid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).setatimes) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNLinearSolver_Ops),
            "::",
            stringify!(setatimes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).setpreconditioner) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNLinearSolver_Ops),
            "::",
            stringify!(setpreconditioner)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).setscalingvectors) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNLinearSolver_Ops),
            "::",
            stringify!(setscalingvectors)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).setzeroguess) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNLinearSolver_Ops),
            "::",
            stringify!(setzeroguess)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).initialize) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNLinearSolver_Ops),
            "::",
            stringify!(initialize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).setup) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNLinearSolver_Ops),
            "::",
            stringify!(setup)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).solve) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNLinearSolver_Ops),
            "::",
            stringify!(solve)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).numiters) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNLinearSolver_Ops),
            "::",
            stringify!(numiters)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).resnorm) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNLinearSolver_Ops),
            "::",
            stringify!(resnorm)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).lastflag) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNLinearSolver_Ops),
            "::",
            stringify!(lastflag)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).space) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNLinearSolver_Ops),
            "::",
            stringify!(space)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).resid) as usize - ptr as usize },
        104usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNLinearSolver_Ops),
            "::",
            stringify!(resid)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).free) as usize - ptr as usize },
        112usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNLinearSolver_Ops),
            "::",
            stringify!(free)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _generic_SUNLinearSolver {
    pub content: *mut ::std::os::raw::c_void,
    pub ops: SUNLinearSolver_Ops,
    pub sunctx: SUNContext,
}
#[test]
fn bindgen_test_layout__generic_SUNLinearSolver() {
    const UNINIT: ::std::mem::MaybeUninit<_generic_SUNLinearSolver> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_generic_SUNLinearSolver>(),
        24usize,
        concat!("Size of: ", stringify!(_generic_SUNLinearSolver))
    );
    assert_eq!(
        ::std::mem::align_of::<_generic_SUNLinearSolver>(),
        8usize,
        concat!("Alignment of ", stringify!(_generic_SUNLinearSolver))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).content) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNLinearSolver),
            "::",
            stringify!(content)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ops) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNLinearSolver),
            "::",
            stringify!(ops)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sunctx) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNLinearSolver),
            "::",
            stringify!(sunctx)
        )
    );
}
impl Default for _generic_SUNLinearSolver {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn SUNLinSolNewEmpty(sunctx: SUNContext) -> SUNLinearSolver;
}
extern "C" {
    pub fn SUNLinSolFreeEmpty(S: SUNLinearSolver);
}
extern "C" {
    pub fn SUNLinSolGetType(S: SUNLinearSolver) -> SUNLinearSolver_Type;
}
extern "C" {
    pub fn SUNLinSolGetID(S: SUNLinearSolver) -> SUNLinearSolver_ID;
}
extern "C" {
    pub fn SUNLinSolSetATimes(
        S: SUNLinearSolver,
        A_data: *mut ::std::os::raw::c_void,
        ATimes: SUNATimesFn,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNLinSolSetPreconditioner(
        S: SUNLinearSolver,
        P_data: *mut ::std::os::raw::c_void,
        Pset: SUNPSetupFn,
        Psol: SUNPSolveFn,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNLinSolSetScalingVectors(S: SUNLinearSolver, s1: N_Vector, s2: N_Vector)
        -> SUNErrCode;
}
extern "C" {
    pub fn SUNLinSolSetZeroGuess(S: SUNLinearSolver, onoff: ::std::os::raw::c_int) -> SUNErrCode;
}
extern "C" {
    pub fn SUNLinSolInitialize(S: SUNLinearSolver) -> SUNErrCode;
}
extern "C" {
    pub fn SUNLinSolSetup(S: SUNLinearSolver, A: SUNMatrix) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SUNLinSolSolve(
        S: SUNLinearSolver,
        A: SUNMatrix,
        x: N_Vector,
        b: N_Vector,
        tol: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SUNLinSolNumIters(S: SUNLinearSolver) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SUNLinSolResNorm(S: SUNLinearSolver) -> sunrealtype;
}
extern "C" {
    pub fn SUNLinSolResid(S: SUNLinearSolver) -> N_Vector;
}
extern "C" {
    pub fn SUNLinSolLastFlag(S: SUNLinearSolver) -> sunindextype;
}
extern "C" {
    pub fn SUNLinSolSpace(
        S: SUNLinearSolver,
        lenrwLS: *mut ::std::os::raw::c_long,
        leniwLS: *mut ::std::os::raw::c_long,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNLinSolFree(S: SUNLinearSolver) -> SUNErrCode;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _N_VectorContent_Serial {
    pub length: sunindextype,
    pub own_data: ::std::os::raw::c_int,
    pub data: *mut sunrealtype,
}
#[test]
fn bindgen_test_layout__N_VectorContent_Serial() {
    const UNINIT: ::std::mem::MaybeUninit<_N_VectorContent_Serial> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_N_VectorContent_Serial>(),
        24usize,
        concat!("Size of: ", stringify!(_N_VectorContent_Serial))
    );
    assert_eq!(
        ::std::mem::align_of::<_N_VectorContent_Serial>(),
        8usize,
        concat!("Alignment of ", stringify!(_N_VectorContent_Serial))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).length) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_N_VectorContent_Serial),
            "::",
            stringify!(length)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).own_data) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_N_VectorContent_Serial),
            "::",
            stringify!(own_data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_N_VectorContent_Serial),
            "::",
            stringify!(data)
        )
    );
}
impl Default for _N_VectorContent_Serial {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type N_VectorContent_Serial = *mut _N_VectorContent_Serial;
extern "C" {
    pub fn N_VNewEmpty_Serial(vec_length: sunindextype, sunctx: SUNContext) -> N_Vector;
}
extern "C" {
    pub fn N_VNew_Serial(vec_length: sunindextype, sunctx: SUNContext) -> N_Vector;
}
extern "C" {
    pub fn N_VMake_Serial(
        vec_length: sunindextype,
        v_data: *mut sunrealtype,
        sunctx: SUNContext,
    ) -> N_Vector;
}
extern "C" {
    pub fn N_VGetLength_Serial(v: N_Vector) -> sunindextype;
}
extern "C" {
    pub fn N_VPrint_Serial(v: N_Vector);
}
extern "C" {
    pub fn N_VPrintFile_Serial(v: N_Vector, outfile: *mut FILE);
}
extern "C" {
    pub fn N_VGetVectorID_Serial(v: N_Vector) -> N_Vector_ID;
}
extern "C" {
    pub fn N_VCloneEmpty_Serial(w: N_Vector) -> N_Vector;
}
extern "C" {
    pub fn N_VClone_Serial(w: N_Vector) -> N_Vector;
}
extern "C" {
    pub fn N_VDestroy_Serial(v: N_Vector);
}
extern "C" {
    pub fn N_VSpace_Serial(v: N_Vector, lrw: *mut sunindextype, liw: *mut sunindextype);
}
extern "C" {
    pub fn N_VGetArrayPointer_Serial(v: N_Vector) -> *mut sunrealtype;
}
extern "C" {
    pub fn N_VSetArrayPointer_Serial(v_data: *mut sunrealtype, v: N_Vector);
}
extern "C" {
    pub fn N_VLinearSum_Serial(
        a: sunrealtype,
        x: N_Vector,
        b: sunrealtype,
        y: N_Vector,
        z: N_Vector,
    );
}
extern "C" {
    pub fn N_VConst_Serial(c: sunrealtype, z: N_Vector);
}
extern "C" {
    pub fn N_VProd_Serial(x: N_Vector, y: N_Vector, z: N_Vector);
}
extern "C" {
    pub fn N_VDiv_Serial(x: N_Vector, y: N_Vector, z: N_Vector);
}
extern "C" {
    pub fn N_VScale_Serial(c: sunrealtype, x: N_Vector, z: N_Vector);
}
extern "C" {
    pub fn N_VAbs_Serial(x: N_Vector, z: N_Vector);
}
extern "C" {
    pub fn N_VInv_Serial(x: N_Vector, z: N_Vector);
}
extern "C" {
    pub fn N_VAddConst_Serial(x: N_Vector, b: sunrealtype, z: N_Vector);
}
extern "C" {
    pub fn N_VDotProd_Serial(x: N_Vector, y: N_Vector) -> sunrealtype;
}
extern "C" {
    pub fn N_VMaxNorm_Serial(x: N_Vector) -> sunrealtype;
}
extern "C" {
    pub fn N_VWrmsNorm_Serial(x: N_Vector, w: N_Vector) -> sunrealtype;
}
extern "C" {
    pub fn N_VWrmsNormMask_Serial(x: N_Vector, w: N_Vector, id: N_Vector) -> sunrealtype;
}
extern "C" {
    pub fn N_VMin_Serial(x: N_Vector) -> sunrealtype;
}
extern "C" {
    pub fn N_VWL2Norm_Serial(x: N_Vector, w: N_Vector) -> sunrealtype;
}
extern "C" {
    pub fn N_VL1Norm_Serial(x: N_Vector) -> sunrealtype;
}
extern "C" {
    pub fn N_VCompare_Serial(c: sunrealtype, x: N_Vector, z: N_Vector);
}
extern "C" {
    pub fn N_VInvTest_Serial(x: N_Vector, z: N_Vector) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn N_VConstrMask_Serial(c: N_Vector, x: N_Vector, m: N_Vector) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn N_VMinQuotient_Serial(num: N_Vector, denom: N_Vector) -> sunrealtype;
}
extern "C" {
    pub fn N_VLinearCombination_Serial(
        nvec: ::std::os::raw::c_int,
        c: *mut sunrealtype,
        V: *mut N_Vector,
        z: N_Vector,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn N_VScaleAddMulti_Serial(
        nvec: ::std::os::raw::c_int,
        a: *mut sunrealtype,
        x: N_Vector,
        Y: *mut N_Vector,
        Z: *mut N_Vector,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn N_VDotProdMulti_Serial(
        nvec: ::std::os::raw::c_int,
        x: N_Vector,
        Y: *mut N_Vector,
        dotprods: *mut sunrealtype,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn N_VLinearSumVectorArray_Serial(
        nvec: ::std::os::raw::c_int,
        a: sunrealtype,
        X: *mut N_Vector,
        b: sunrealtype,
        Y: *mut N_Vector,
        Z: *mut N_Vector,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn N_VScaleVectorArray_Serial(
        nvec: ::std::os::raw::c_int,
        c: *mut sunrealtype,
        X: *mut N_Vector,
        Z: *mut N_Vector,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn N_VConstVectorArray_Serial(
        nvecs: ::std::os::raw::c_int,
        c: sunrealtype,
        Z: *mut N_Vector,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn N_VWrmsNormVectorArray_Serial(
        nvecs: ::std::os::raw::c_int,
        X: *mut N_Vector,
        W: *mut N_Vector,
        nrm: *mut sunrealtype,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn N_VWrmsNormMaskVectorArray_Serial(
        nvecs: ::std::os::raw::c_int,
        X: *mut N_Vector,
        W: *mut N_Vector,
        id: N_Vector,
        nrm: *mut sunrealtype,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn N_VScaleAddMultiVectorArray_Serial(
        nvec: ::std::os::raw::c_int,
        nsum: ::std::os::raw::c_int,
        a: *mut sunrealtype,
        X: *mut N_Vector,
        Y: *mut *mut N_Vector,
        Z: *mut *mut N_Vector,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn N_VLinearCombinationVectorArray_Serial(
        nvec: ::std::os::raw::c_int,
        nsum: ::std::os::raw::c_int,
        c: *mut sunrealtype,
        X: *mut *mut N_Vector,
        Z: *mut N_Vector,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn N_VWSqrSumLocal_Serial(x: N_Vector, w: N_Vector) -> sunrealtype;
}
extern "C" {
    pub fn N_VWSqrSumMaskLocal_Serial(x: N_Vector, w: N_Vector, id: N_Vector) -> sunrealtype;
}
extern "C" {
    pub fn N_VBufSize_Serial(x: N_Vector, size: *mut sunindextype) -> SUNErrCode;
}
extern "C" {
    pub fn N_VBufPack_Serial(x: N_Vector, buf: *mut ::std::os::raw::c_void) -> SUNErrCode;
}
extern "C" {
    pub fn N_VBufUnpack_Serial(x: N_Vector, buf: *mut ::std::os::raw::c_void) -> SUNErrCode;
}
extern "C" {
    pub fn N_VEnableFusedOps_Serial(v: N_Vector, tf: ::std::os::raw::c_int) -> SUNErrCode;
}
extern "C" {
    pub fn N_VEnableLinearCombination_Serial(v: N_Vector, tf: ::std::os::raw::c_int) -> SUNErrCode;
}
extern "C" {
    pub fn N_VEnableScaleAddMulti_Serial(v: N_Vector, tf: ::std::os::raw::c_int) -> SUNErrCode;
}
extern "C" {
    pub fn N_VEnableDotProdMulti_Serial(v: N_Vector, tf: ::std::os::raw::c_int) -> SUNErrCode;
}
extern "C" {
    pub fn N_VEnableLinearSumVectorArray_Serial(
        v: N_Vector,
        tf: ::std::os::raw::c_int,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn N_VEnableScaleVectorArray_Serial(v: N_Vector, tf: ::std::os::raw::c_int) -> SUNErrCode;
}
extern "C" {
    pub fn N_VEnableConstVectorArray_Serial(v: N_Vector, tf: ::std::os::raw::c_int) -> SUNErrCode;
}
extern "C" {
    pub fn N_VEnableWrmsNormVectorArray_Serial(
        v: N_Vector,
        tf: ::std::os::raw::c_int,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn N_VEnableWrmsNormMaskVectorArray_Serial(
        v: N_Vector,
        tf: ::std::os::raw::c_int,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn N_VEnableScaleAddMultiVectorArray_Serial(
        v: N_Vector,
        tf: ::std::os::raw::c_int,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn N_VEnableLinearCombinationVectorArray_Serial(
        v: N_Vector,
        tf: ::std::os::raw::c_int,
    ) -> SUNErrCode;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SUNMatrixContent_Dense {
    pub M: sunindextype,
    pub N: sunindextype,
    pub data: *mut sunrealtype,
    pub ldata: sunindextype,
    pub cols: *mut *mut sunrealtype,
}
#[test]
fn bindgen_test_layout__SUNMatrixContent_Dense() {
    const UNINIT: ::std::mem::MaybeUninit<_SUNMatrixContent_Dense> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_SUNMatrixContent_Dense>(),
        40usize,
        concat!("Size of: ", stringify!(_SUNMatrixContent_Dense))
    );
    assert_eq!(
        ::std::mem::align_of::<_SUNMatrixContent_Dense>(),
        8usize,
        concat!("Alignment of ", stringify!(_SUNMatrixContent_Dense))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).M) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SUNMatrixContent_Dense),
            "::",
            stringify!(M)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).N) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_SUNMatrixContent_Dense),
            "::",
            stringify!(N)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_SUNMatrixContent_Dense),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ldata) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_SUNMatrixContent_Dense),
            "::",
            stringify!(ldata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cols) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_SUNMatrixContent_Dense),
            "::",
            stringify!(cols)
        )
    );
}
impl Default for _SUNMatrixContent_Dense {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type SUNMatrixContent_Dense = *mut _SUNMatrixContent_Dense;
extern "C" {
    pub fn SUNDenseMatrix(M: sunindextype, N: sunindextype, sunctx: SUNContext) -> SUNMatrix;
}
extern "C" {
    pub fn SUNDenseMatrix_Print(A: SUNMatrix, outfile: *mut FILE);
}
extern "C" {
    pub fn SUNDenseMatrix_Rows(A: SUNMatrix) -> sunindextype;
}
extern "C" {
    pub fn SUNDenseMatrix_Columns(A: SUNMatrix) -> sunindextype;
}
extern "C" {
    pub fn SUNDenseMatrix_LData(A: SUNMatrix) -> sunindextype;
}
extern "C" {
    pub fn SUNDenseMatrix_Data(A: SUNMatrix) -> *mut sunrealtype;
}
extern "C" {
    pub fn SUNDenseMatrix_Cols(A: SUNMatrix) -> *mut *mut sunrealtype;
}
extern "C" {
    pub fn SUNDenseMatrix_Column(A: SUNMatrix, j: sunindextype) -> *mut sunrealtype;
}
extern "C" {
    pub fn SUNMatGetID_Dense(A: SUNMatrix) -> SUNMatrix_ID;
}
extern "C" {
    pub fn SUNMatClone_Dense(A: SUNMatrix) -> SUNMatrix;
}
extern "C" {
    pub fn SUNMatDestroy_Dense(A: SUNMatrix);
}
extern "C" {
    pub fn SUNMatZero_Dense(A: SUNMatrix) -> SUNErrCode;
}
extern "C" {
    pub fn SUNMatCopy_Dense(A: SUNMatrix, B: SUNMatrix) -> SUNErrCode;
}
extern "C" {
    pub fn SUNMatScaleAdd_Dense(c: sunrealtype, A: SUNMatrix, B: SUNMatrix) -> SUNErrCode;
}
extern "C" {
    pub fn SUNMatScaleAddI_Dense(c: sunrealtype, A: SUNMatrix) -> SUNErrCode;
}
extern "C" {
    pub fn SUNMatMatvec_Dense(A: SUNMatrix, x: N_Vector, y: N_Vector) -> SUNErrCode;
}
extern "C" {
    pub fn SUNMatHermitianTransposeVec_Dense(A: SUNMatrix, x: N_Vector, y: N_Vector) -> SUNErrCode;
}
extern "C" {
    pub fn SUNMatSpace_Dense(
        A: SUNMatrix,
        lenrw: *mut ::std::os::raw::c_long,
        leniw: *mut ::std::os::raw::c_long,
    ) -> SUNErrCode;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _DlsMat {
    pub type_: ::std::os::raw::c_int,
    pub M: sunindextype,
    pub N: sunindextype,
    pub ldim: sunindextype,
    pub mu: sunindextype,
    pub ml: sunindextype,
    pub s_mu: sunindextype,
    pub data: *mut sunrealtype,
    pub ldata: sunindextype,
    pub cols: *mut *mut sunrealtype,
}
#[test]
fn bindgen_test_layout__DlsMat() {
    const UNINIT: ::std::mem::MaybeUninit<_DlsMat> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_DlsMat>(),
        80usize,
        concat!("Size of: ", stringify!(_DlsMat))
    );
    assert_eq!(
        ::std::mem::align_of::<_DlsMat>(),
        8usize,
        concat!("Alignment of ", stringify!(_DlsMat))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_DlsMat),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).M) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_DlsMat),
            "::",
            stringify!(M)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).N) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_DlsMat),
            "::",
            stringify!(N)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ldim) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_DlsMat),
            "::",
            stringify!(ldim)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).mu) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_DlsMat),
            "::",
            stringify!(mu)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ml) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_DlsMat),
            "::",
            stringify!(ml)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).s_mu) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_DlsMat),
            "::",
            stringify!(s_mu)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).data) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_DlsMat),
            "::",
            stringify!(data)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ldata) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_DlsMat),
            "::",
            stringify!(ldata)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).cols) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_DlsMat),
            "::",
            stringify!(cols)
        )
    );
}
impl Default for _DlsMat {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type SUNDlsMat = *mut _DlsMat;
extern "C" {
    pub fn SUNDlsMat_NewDenseMat(M: sunindextype, N: sunindextype) -> SUNDlsMat;
}
extern "C" {
    pub fn SUNDlsMat_NewBandMat(
        N: sunindextype,
        mu: sunindextype,
        ml: sunindextype,
        smu: sunindextype,
    ) -> SUNDlsMat;
}
extern "C" {
    pub fn SUNDlsMat_DestroyMat(A: SUNDlsMat);
}
extern "C" {
    pub fn SUNDlsMat_NewIntArray(N: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_int;
}
extern "C" {
    pub fn SUNDlsMat_NewIndexArray(N: sunindextype) -> *mut sunindextype;
}
extern "C" {
    pub fn SUNDlsMat_NewRealArray(N: sunindextype) -> *mut sunrealtype;
}
extern "C" {
    pub fn SUNDlsMat_DestroyArray(p: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn SUNDlsMat_AddIdentity(A: SUNDlsMat);
}
extern "C" {
    pub fn SUNDlsMat_SetToZero(A: SUNDlsMat);
}
extern "C" {
    pub fn SUNDlsMat_PrintMat(A: SUNDlsMat, outfile: *mut FILE);
}
extern "C" {
    pub fn SUNDlsMat_newDenseMat(m: sunindextype, n: sunindextype) -> *mut *mut sunrealtype;
}
extern "C" {
    pub fn SUNDlsMat_newBandMat(
        n: sunindextype,
        smu: sunindextype,
        ml: sunindextype,
    ) -> *mut *mut sunrealtype;
}
extern "C" {
    pub fn SUNDlsMat_destroyMat(a: *mut *mut sunrealtype);
}
extern "C" {
    pub fn SUNDlsMat_newIntArray(n: ::std::os::raw::c_int) -> *mut ::std::os::raw::c_int;
}
extern "C" {
    pub fn SUNDlsMat_newIndexArray(n: sunindextype) -> *mut sunindextype;
}
extern "C" {
    pub fn SUNDlsMat_newRealArray(m: sunindextype) -> *mut sunrealtype;
}
extern "C" {
    pub fn SUNDlsMat_destroyArray(v: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn SUNDlsMat_DenseGETRF(A: SUNDlsMat, p: *mut sunindextype) -> sunindextype;
}
extern "C" {
    pub fn SUNDlsMat_DenseGETRS(A: SUNDlsMat, p: *mut sunindextype, b: *mut sunrealtype);
}
extern "C" {
    pub fn SUNDlsMat_denseGETRF(
        a: *mut *mut sunrealtype,
        m: sunindextype,
        n: sunindextype,
        p: *mut sunindextype,
    ) -> sunindextype;
}
extern "C" {
    pub fn SUNDlsMat_denseGETRS(
        a: *mut *mut sunrealtype,
        n: sunindextype,
        p: *mut sunindextype,
        b: *mut sunrealtype,
    );
}
extern "C" {
    pub fn SUNDlsMat_DensePOTRF(A: SUNDlsMat) -> sunindextype;
}
extern "C" {
    pub fn SUNDlsMat_DensePOTRS(A: SUNDlsMat, b: *mut sunrealtype);
}
extern "C" {
    pub fn SUNDlsMat_densePOTRF(a: *mut *mut sunrealtype, m: sunindextype) -> sunindextype;
}
extern "C" {
    pub fn SUNDlsMat_densePOTRS(a: *mut *mut sunrealtype, m: sunindextype, b: *mut sunrealtype);
}
extern "C" {
    pub fn SUNDlsMat_DenseGEQRF(
        A: SUNDlsMat,
        beta: *mut sunrealtype,
        wrk: *mut sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SUNDlsMat_DenseORMQR(
        A: SUNDlsMat,
        beta: *mut sunrealtype,
        vn: *mut sunrealtype,
        vm: *mut sunrealtype,
        wrk: *mut sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SUNDlsMat_denseGEQRF(
        a: *mut *mut sunrealtype,
        m: sunindextype,
        n: sunindextype,
        beta: *mut sunrealtype,
        wrk: *mut sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SUNDlsMat_denseORMQR(
        a: *mut *mut sunrealtype,
        m: sunindextype,
        n: sunindextype,
        beta: *mut sunrealtype,
        v: *mut sunrealtype,
        w: *mut sunrealtype,
        wrk: *mut sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SUNDlsMat_DenseCopy(A: SUNDlsMat, B: SUNDlsMat);
}
extern "C" {
    pub fn SUNDlsMat_denseCopy(
        a: *mut *mut sunrealtype,
        b: *mut *mut sunrealtype,
        m: sunindextype,
        n: sunindextype,
    );
}
extern "C" {
    pub fn SUNDlsMat_DenseScale(c: sunrealtype, A: SUNDlsMat);
}
extern "C" {
    pub fn SUNDlsMat_denseScale(
        c: sunrealtype,
        a: *mut *mut sunrealtype,
        m: sunindextype,
        n: sunindextype,
    );
}
extern "C" {
    pub fn SUNDlsMat_denseAddIdentity(a: *mut *mut sunrealtype, n: sunindextype);
}
extern "C" {
    pub fn SUNDlsMat_DenseMatvec(A: SUNDlsMat, x: *mut sunrealtype, y: *mut sunrealtype);
}
extern "C" {
    pub fn SUNDlsMat_denseMatvec(
        a: *mut *mut sunrealtype,
        x: *mut sunrealtype,
        y: *mut sunrealtype,
        m: sunindextype,
        n: sunindextype,
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _SUNLinearSolverContent_Dense {
    pub N: sunindextype,
    pub pivots: *mut sunindextype,
    pub last_flag: sunindextype,
}
#[test]
fn bindgen_test_layout__SUNLinearSolverContent_Dense() {
    const UNINIT: ::std::mem::MaybeUninit<_SUNLinearSolverContent_Dense> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_SUNLinearSolverContent_Dense>(),
        24usize,
        concat!("Size of: ", stringify!(_SUNLinearSolverContent_Dense))
    );
    assert_eq!(
        ::std::mem::align_of::<_SUNLinearSolverContent_Dense>(),
        8usize,
        concat!("Alignment of ", stringify!(_SUNLinearSolverContent_Dense))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).N) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_SUNLinearSolverContent_Dense),
            "::",
            stringify!(N)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).pivots) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_SUNLinearSolverContent_Dense),
            "::",
            stringify!(pivots)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).last_flag) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_SUNLinearSolverContent_Dense),
            "::",
            stringify!(last_flag)
        )
    );
}
impl Default for _SUNLinearSolverContent_Dense {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
pub type SUNLinearSolverContent_Dense = *mut _SUNLinearSolverContent_Dense;
extern "C" {
    pub fn SUNLinSol_Dense(y: N_Vector, A: SUNMatrix, sunctx: SUNContext) -> SUNLinearSolver;
}
extern "C" {
    pub fn SUNLinSolGetType_Dense(S: SUNLinearSolver) -> SUNLinearSolver_Type;
}
extern "C" {
    pub fn SUNLinSolGetID_Dense(S: SUNLinearSolver) -> SUNLinearSolver_ID;
}
extern "C" {
    pub fn SUNLinSolInitialize_Dense(S: SUNLinearSolver) -> SUNErrCode;
}
extern "C" {
    pub fn SUNLinSolSetup_Dense(S: SUNLinearSolver, A: SUNMatrix) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SUNLinSolSolve_Dense(
        S: SUNLinearSolver,
        A: SUNMatrix,
        x: N_Vector,
        b: N_Vector,
        tol: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SUNLinSolLastFlag_Dense(S: SUNLinearSolver) -> sunindextype;
}
extern "C" {
    pub fn SUNLinSolSpace_Dense(
        S: SUNLinearSolver,
        lenrwLS: *mut ::std::os::raw::c_long,
        leniwLS: *mut ::std::os::raw::c_long,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNLinSolFree_Dense(S: SUNLinearSolver) -> SUNErrCode;
}
pub type CVLsJacFn = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        y: N_Vector,
        fy: N_Vector,
        Jac: SUNMatrix,
        user_data: *mut ::std::os::raw::c_void,
        tmp1: N_Vector,
        tmp2: N_Vector,
        tmp3: N_Vector,
    ) -> ::std::os::raw::c_int,
>;
pub type CVLsPrecSetupFn = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        y: N_Vector,
        fy: N_Vector,
        jok: ::std::os::raw::c_int,
        jcurPtr: *mut ::std::os::raw::c_int,
        gamma: sunrealtype,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type CVLsPrecSolveFn = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        y: N_Vector,
        fy: N_Vector,
        r: N_Vector,
        z: N_Vector,
        gamma: sunrealtype,
        delta: sunrealtype,
        lr: ::std::os::raw::c_int,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type CVLsJacTimesSetupFn = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        y: N_Vector,
        fy: N_Vector,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type CVLsJacTimesVecFn = ::std::option::Option<
    unsafe extern "C" fn(
        v: N_Vector,
        Jv: N_Vector,
        t: sunrealtype,
        y: N_Vector,
        fy: N_Vector,
        user_data: *mut ::std::os::raw::c_void,
        tmp: N_Vector,
    ) -> ::std::os::raw::c_int,
>;
pub type CVLsLinSysFn = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        y: N_Vector,
        fy: N_Vector,
        A: SUNMatrix,
        jok: ::std::os::raw::c_int,
        jcur: *mut ::std::os::raw::c_int,
        gamma: sunrealtype,
        user_data: *mut ::std::os::raw::c_void,
        tmp1: N_Vector,
        tmp2: N_Vector,
        tmp3: N_Vector,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn CVodeSetLinearSolver(
        cvode_mem: *mut ::std::os::raw::c_void,
        LS: SUNLinearSolver,
        A: SUNMatrix,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetJacFn(
        cvode_mem: *mut ::std::os::raw::c_void,
        jac: CVLsJacFn,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetJacEvalFrequency(
        cvode_mem: *mut ::std::os::raw::c_void,
        msbj: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetLinearSolutionScaling(
        cvode_mem: *mut ::std::os::raw::c_void,
        onoff: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetDeltaGammaMaxBadJac(
        cvode_mem: *mut ::std::os::raw::c_void,
        dgmax_jbad: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetEpsLin(
        cvode_mem: *mut ::std::os::raw::c_void,
        eplifac: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetLSNormFactor(
        arkode_mem: *mut ::std::os::raw::c_void,
        nrmfac: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetPreconditioner(
        cvode_mem: *mut ::std::os::raw::c_void,
        pset: CVLsPrecSetupFn,
        psolve: CVLsPrecSolveFn,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetJacTimes(
        cvode_mem: *mut ::std::os::raw::c_void,
        jtsetup: CVLsJacTimesSetupFn,
        jtimes: CVLsJacTimesVecFn,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetLinSysFn(
        cvode_mem: *mut ::std::os::raw::c_void,
        linsys: CVLsLinSysFn,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetJac(
        cvode_mem: *mut ::std::os::raw::c_void,
        J: *mut SUNMatrix,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetJacTime(
        cvode_mem: *mut ::std::os::raw::c_void,
        t_J: *mut sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetJacNumSteps(
        cvode_mem: *mut ::std::os::raw::c_void,
        nst_J: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetLinWorkSpace(
        cvode_mem: *mut ::std::os::raw::c_void,
        lenrwLS: *mut ::std::os::raw::c_long,
        leniwLS: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetNumJacEvals(
        cvode_mem: *mut ::std::os::raw::c_void,
        njevals: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetNumPrecEvals(
        cvode_mem: *mut ::std::os::raw::c_void,
        npevals: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetNumPrecSolves(
        cvode_mem: *mut ::std::os::raw::c_void,
        npsolves: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetNumLinIters(
        cvode_mem: *mut ::std::os::raw::c_void,
        nliters: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetNumLinConvFails(
        cvode_mem: *mut ::std::os::raw::c_void,
        nlcfails: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetNumJTSetupEvals(
        cvode_mem: *mut ::std::os::raw::c_void,
        njtsetups: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetNumJtimesEvals(
        cvode_mem: *mut ::std::os::raw::c_void,
        njvevals: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetNumLinRhsEvals(
        cvode_mem: *mut ::std::os::raw::c_void,
        nfevalsLS: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetLinSolveStats(
        cvode_mem: *mut ::std::os::raw::c_void,
        njevals: *mut ::std::os::raw::c_long,
        nfevalsLS: *mut ::std::os::raw::c_long,
        nliters: *mut ::std::os::raw::c_long,
        nlcfails: *mut ::std::os::raw::c_long,
        npevals: *mut ::std::os::raw::c_long,
        npsolves: *mut ::std::os::raw::c_long,
        njtsetups: *mut ::std::os::raw::c_long,
        njtimes: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetLastLinFlag(
        cvode_mem: *mut ::std::os::raw::c_void,
        flag: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetLinReturnFlagName(flag: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
pub type CVProjFn = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        ycur: N_Vector,
        corr: N_Vector,
        epsProj: sunrealtype,
        err: N_Vector,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn CVodeSetProjFn(
        cvode_mem: *mut ::std::os::raw::c_void,
        pfun: CVProjFn,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetProjErrEst(
        cvode_mem: *mut ::std::os::raw::c_void,
        onoff: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetProjFrequency(
        cvode_mem: *mut ::std::os::raw::c_void,
        proj_freq: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetMaxNumProjFails(
        cvode_mem: *mut ::std::os::raw::c_void,
        max_fails: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetEpsProj(
        cvode_mem: *mut ::std::os::raw::c_void,
        eps: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetProjFailEta(
        cvode_mem: *mut ::std::os::raw::c_void,
        eta: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetNumProjEvals(
        cvode_mem: *mut ::std::os::raw::c_void,
        nproj: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetNumProjFails(
        cvode_mem: *mut ::std::os::raw::c_void,
        nprf: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
pub const SUNAdaptController_Type_SUN_ADAPTCONTROLLER_NONE: SUNAdaptController_Type = 0;
pub const SUNAdaptController_Type_SUN_ADAPTCONTROLLER_H: SUNAdaptController_Type = 1;
pub const SUNAdaptController_Type_SUN_ADAPTCONTROLLER_MRI_H_TOL: SUNAdaptController_Type = 2;
pub type SUNAdaptController_Type = ::std::os::raw::c_uint;
pub type SUNAdaptController_Ops = *mut _generic_SUNAdaptController_Ops;
pub type SUNAdaptController = *mut _generic_SUNAdaptController;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _generic_SUNAdaptController_Ops {
    pub gettype: ::std::option::Option<
        unsafe extern "C" fn(C: SUNAdaptController) -> SUNAdaptController_Type,
    >,
    pub estimatestep: ::std::option::Option<
        unsafe extern "C" fn(
            C: SUNAdaptController,
            h: sunrealtype,
            p: ::std::os::raw::c_int,
            dsm: sunrealtype,
            hnew: *mut sunrealtype,
        ) -> SUNErrCode,
    >,
    pub estimatesteptol: ::std::option::Option<
        unsafe extern "C" fn(
            C: SUNAdaptController,
            H: sunrealtype,
            tolfac: sunrealtype,
            P: ::std::os::raw::c_int,
            DSM: sunrealtype,
            dsm: sunrealtype,
            Hnew: *mut sunrealtype,
            tolfacnew: *mut sunrealtype,
        ) -> SUNErrCode,
    >,
    pub destroy: ::std::option::Option<unsafe extern "C" fn(C: SUNAdaptController) -> SUNErrCode>,
    pub reset: ::std::option::Option<unsafe extern "C" fn(C: SUNAdaptController) -> SUNErrCode>,
    pub setdefaults:
        ::std::option::Option<unsafe extern "C" fn(C: SUNAdaptController) -> SUNErrCode>,
    pub write: ::std::option::Option<
        unsafe extern "C" fn(C: SUNAdaptController, fptr: *mut FILE) -> SUNErrCode,
    >,
    pub seterrorbias: ::std::option::Option<
        unsafe extern "C" fn(C: SUNAdaptController, bias: sunrealtype) -> SUNErrCode,
    >,
    pub updateh: ::std::option::Option<
        unsafe extern "C" fn(C: SUNAdaptController, h: sunrealtype, dsm: sunrealtype) -> SUNErrCode,
    >,
    pub updatemrihtol: ::std::option::Option<
        unsafe extern "C" fn(
            C: SUNAdaptController,
            H: sunrealtype,
            tolfac: sunrealtype,
            DSM: sunrealtype,
            dsm: sunrealtype,
        ) -> SUNErrCode,
    >,
    pub space: ::std::option::Option<
        unsafe extern "C" fn(
            C: SUNAdaptController,
            lenrw: *mut ::std::os::raw::c_long,
            leniw: *mut ::std::os::raw::c_long,
        ) -> SUNErrCode,
    >,
}
#[test]
fn bindgen_test_layout__generic_SUNAdaptController_Ops() {
    const UNINIT: ::std::mem::MaybeUninit<_generic_SUNAdaptController_Ops> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_generic_SUNAdaptController_Ops>(),
        88usize,
        concat!("Size of: ", stringify!(_generic_SUNAdaptController_Ops))
    );
    assert_eq!(
        ::std::mem::align_of::<_generic_SUNAdaptController_Ops>(),
        8usize,
        concat!("Alignment of ", stringify!(_generic_SUNAdaptController_Ops))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gettype) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNAdaptController_Ops),
            "::",
            stringify!(gettype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).estimatestep) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNAdaptController_Ops),
            "::",
            stringify!(estimatestep)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).estimatesteptol) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNAdaptController_Ops),
            "::",
            stringify!(estimatesteptol)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).destroy) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNAdaptController_Ops),
            "::",
            stringify!(destroy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).reset) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNAdaptController_Ops),
            "::",
            stringify!(reset)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).setdefaults) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNAdaptController_Ops),
            "::",
            stringify!(setdefaults)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).write) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNAdaptController_Ops),
            "::",
            stringify!(write)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).seterrorbias) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNAdaptController_Ops),
            "::",
            stringify!(seterrorbias)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).updateh) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNAdaptController_Ops),
            "::",
            stringify!(updateh)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).updatemrihtol) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNAdaptController_Ops),
            "::",
            stringify!(updatemrihtol)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).space) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNAdaptController_Ops),
            "::",
            stringify!(space)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _generic_SUNAdaptController {
    pub content: *mut ::std::os::raw::c_void,
    pub ops: SUNAdaptController_Ops,
    pub sunctx: SUNContext,
}
#[test]
fn bindgen_test_layout__generic_SUNAdaptController() {
    const UNINIT: ::std::mem::MaybeUninit<_generic_SUNAdaptController> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_generic_SUNAdaptController>(),
        24usize,
        concat!("Size of: ", stringify!(_generic_SUNAdaptController))
    );
    assert_eq!(
        ::std::mem::align_of::<_generic_SUNAdaptController>(),
        8usize,
        concat!("Alignment of ", stringify!(_generic_SUNAdaptController))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).content) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNAdaptController),
            "::",
            stringify!(content)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ops) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNAdaptController),
            "::",
            stringify!(ops)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sunctx) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNAdaptController),
            "::",
            stringify!(sunctx)
        )
    );
}
impl Default for _generic_SUNAdaptController {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn SUNAdaptController_NewEmpty(sunctx: SUNContext) -> SUNAdaptController;
}
extern "C" {
    pub fn SUNAdaptController_DestroyEmpty(C: SUNAdaptController);
}
extern "C" {
    pub fn SUNAdaptController_GetType(C: SUNAdaptController) -> SUNAdaptController_Type;
}
extern "C" {
    pub fn SUNAdaptController_Destroy(C: SUNAdaptController) -> SUNErrCode;
}
extern "C" {
    pub fn SUNAdaptController_EstimateStep(
        C: SUNAdaptController,
        h: sunrealtype,
        p: ::std::os::raw::c_int,
        dsm: sunrealtype,
        hnew: *mut sunrealtype,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNAdaptController_EstimateStepTol(
        C: SUNAdaptController,
        H: sunrealtype,
        tolfac: sunrealtype,
        P: ::std::os::raw::c_int,
        DSM: sunrealtype,
        dsm: sunrealtype,
        Hnew: *mut sunrealtype,
        tolfacnew: *mut sunrealtype,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNAdaptController_Reset(C: SUNAdaptController) -> SUNErrCode;
}
extern "C" {
    pub fn SUNAdaptController_SetDefaults(C: SUNAdaptController) -> SUNErrCode;
}
extern "C" {
    pub fn SUNAdaptController_Write(C: SUNAdaptController, fptr: *mut FILE) -> SUNErrCode;
}
extern "C" {
    pub fn SUNAdaptController_SetErrorBias(C: SUNAdaptController, bias: sunrealtype) -> SUNErrCode;
}
extern "C" {
    pub fn SUNAdaptController_UpdateH(
        C: SUNAdaptController,
        h: sunrealtype,
        dsm: sunrealtype,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNAdaptController_UpdateMRIHTol(
        C: SUNAdaptController,
        H: sunrealtype,
        tolfac: sunrealtype,
        DSM: sunrealtype,
        dsm: sunrealtype,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNAdaptController_Space(
        C: SUNAdaptController,
        lenrw: *mut ::std::os::raw::c_long,
        leniw: *mut ::std::os::raw::c_long,
    ) -> SUNErrCode;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SUNAdjointCheckpointScheme_ {
    _unused: [u8; 0],
}
pub type SUNAdjointCheckpointScheme = *mut SUNAdjointCheckpointScheme_;
pub type SUNAdjointCheckpointSchemeNeedsSavingFn = ::std::option::Option<
    unsafe extern "C" fn(
        check_scheme: SUNAdjointCheckpointScheme,
        step_num: suncountertype,
        stage_num: suncountertype,
        t: sunrealtype,
        yes_or_no: *mut ::std::os::raw::c_int,
    ) -> SUNErrCode,
>;
pub type SUNAdjointCheckpointSchemeInsertVectorFn = ::std::option::Option<
    unsafe extern "C" fn(
        check_scheme: SUNAdjointCheckpointScheme,
        step_num: suncountertype,
        stage_num: suncountertype,
        t: sunrealtype,
        y: N_Vector,
    ) -> SUNErrCode,
>;
pub type SUNAdjointCheckpointSchemeLoadVectorFn = ::std::option::Option<
    unsafe extern "C" fn(
        check_scheme: SUNAdjointCheckpointScheme,
        step_num: suncountertype,
        stage_num: suncountertype,
        peek: ::std::os::raw::c_int,
        yout: *mut N_Vector,
        tout: *mut sunrealtype,
    ) -> SUNErrCode,
>;
pub type SUNAdjointCheckpointSchemeDestroyFn = ::std::option::Option<
    unsafe extern "C" fn(check_scheme: *mut SUNAdjointCheckpointScheme) -> SUNErrCode,
>;
pub type SUNAdjointCheckpointSchemeEnableDenseFn = ::std::option::Option<
    unsafe extern "C" fn(
        check_scheme: SUNAdjointCheckpointScheme,
        on_or_off: ::std::os::raw::c_int,
    ) -> SUNErrCode,
>;
extern "C" {
    pub fn SUNAdjointCheckpointScheme_NewEmpty(
        sunctx: SUNContext,
        arg1: *mut SUNAdjointCheckpointScheme,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNAdjointCheckpointScheme_SetNeedsSavingFn(
        check_scheme: SUNAdjointCheckpointScheme,
        arg1: SUNAdjointCheckpointSchemeNeedsSavingFn,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNAdjointCheckpointScheme_SetInsertVectorFn(
        check_scheme: SUNAdjointCheckpointScheme,
        arg1: SUNAdjointCheckpointSchemeInsertVectorFn,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNAdjointCheckpointScheme_SetLoadVectorFn(
        check_scheme: SUNAdjointCheckpointScheme,
        arg1: SUNAdjointCheckpointSchemeLoadVectorFn,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNAdjointCheckpointScheme_SetDestroyFn(
        check_scheme: SUNAdjointCheckpointScheme,
        arg1: SUNAdjointCheckpointSchemeDestroyFn,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNAdjointCheckpointScheme_SetEnableDenseFn(
        check_scheme: SUNAdjointCheckpointScheme,
        arg1: SUNAdjointCheckpointSchemeEnableDenseFn,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNAdjointCheckpointScheme_SetContent(
        check_scheme: SUNAdjointCheckpointScheme,
        content: *mut ::std::os::raw::c_void,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNAdjointCheckpointScheme_GetContent(
        check_scheme: SUNAdjointCheckpointScheme,
        content: *mut *mut ::std::os::raw::c_void,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNAdjointCheckpointScheme_NeedsSaving(
        check_scheme: SUNAdjointCheckpointScheme,
        step_num: suncountertype,
        stage_num: suncountertype,
        t: sunrealtype,
        yes_or_no: *mut ::std::os::raw::c_int,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNAdjointCheckpointScheme_InsertVector(
        check_scheme: SUNAdjointCheckpointScheme,
        step_num: suncountertype,
        stage_num: suncountertype,
        t: sunrealtype,
        state: N_Vector,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNAdjointCheckpointScheme_LoadVector(
        check_scheme: SUNAdjointCheckpointScheme,
        step_num: suncountertype,
        stage_num: suncountertype,
        peek: ::std::os::raw::c_int,
        out: *mut N_Vector,
        tout: *mut sunrealtype,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNAdjointCheckpointScheme_Destroy(arg1: *mut SUNAdjointCheckpointScheme) -> SUNErrCode;
}
extern "C" {
    pub fn SUNAdjointCheckpointScheme_EnableDense(
        check_scheme: SUNAdjointCheckpointScheme,
        on_or_off: ::std::os::raw::c_int,
    ) -> SUNErrCode;
}
pub const SUNFullRhsMode_SUN_FULLRHS_START: SUNFullRhsMode = 0;
pub const SUNFullRhsMode_SUN_FULLRHS_END: SUNFullRhsMode = 1;
pub const SUNFullRhsMode_SUN_FULLRHS_OTHER: SUNFullRhsMode = 2;
pub type SUNFullRhsMode = ::std::os::raw::c_uint;
pub type SUNRhsJacFn = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        y: N_Vector,
        fy: N_Vector,
        Jac: SUNMatrix,
        user_data: *mut ::std::os::raw::c_void,
        tmp1: N_Vector,
        tmp2: N_Vector,
        tmp3: N_Vector,
    ) -> ::std::os::raw::c_int,
>;
pub type SUNRhsJacTimesFn = ::std::option::Option<
    unsafe extern "C" fn(
        v: N_Vector,
        Jv: N_Vector,
        t: sunrealtype,
        y: N_Vector,
        fy: N_Vector,
        user_data: *mut ::std::os::raw::c_void,
        tmp: N_Vector,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SUNStepper_ {
    _unused: [u8; 0],
}
pub type SUNStepper = *mut SUNStepper_;
pub type SUNStepperEvolveFn = ::std::option::Option<
    unsafe extern "C" fn(
        stepper: SUNStepper,
        tout: sunrealtype,
        vret: N_Vector,
        tret: *mut sunrealtype,
    ) -> SUNErrCode,
>;
pub type SUNStepperOneStepFn = ::std::option::Option<
    unsafe extern "C" fn(
        stepper: SUNStepper,
        tout: sunrealtype,
        vret: N_Vector,
        tret: *mut sunrealtype,
    ) -> SUNErrCode,
>;
pub type SUNStepperFullRhsFn = ::std::option::Option<
    unsafe extern "C" fn(
        stepper: SUNStepper,
        t: sunrealtype,
        v: N_Vector,
        f: N_Vector,
        mode: SUNFullRhsMode,
    ) -> SUNErrCode,
>;
pub type SUNStepperReInitFn = ::std::option::Option<
    unsafe extern "C" fn(stepper: SUNStepper, t0: sunrealtype, v0: N_Vector) -> SUNErrCode,
>;
pub type SUNStepperResetFn = ::std::option::Option<
    unsafe extern "C" fn(stepper: SUNStepper, tR: sunrealtype, vR: N_Vector) -> SUNErrCode,
>;
pub type SUNStepperResetCheckpointIndexFn = ::std::option::Option<
    unsafe extern "C" fn(stepper: SUNStepper, ckptIdxR: suncountertype) -> SUNErrCode,
>;
pub type SUNStepperSetStopTimeFn = ::std::option::Option<
    unsafe extern "C" fn(stepper: SUNStepper, tstop: sunrealtype) -> SUNErrCode,
>;
pub type SUNStepperSetStepDirectionFn = ::std::option::Option<
    unsafe extern "C" fn(stepper: SUNStepper, stepdir: sunrealtype) -> SUNErrCode,
>;
pub type SUNStepperSetForcingFn = ::std::option::Option<
    unsafe extern "C" fn(
        stepper: SUNStepper,
        tshift: sunrealtype,
        tscale: sunrealtype,
        forcing: *mut N_Vector,
        nforcing: ::std::os::raw::c_int,
    ) -> SUNErrCode,
>;
pub type SUNStepperGetNumStepsFn = ::std::option::Option<
    unsafe extern "C" fn(stepper: SUNStepper, nst: *mut suncountertype) -> SUNErrCode,
>;
pub type SUNStepperDestroyFn =
    ::std::option::Option<unsafe extern "C" fn(stepper: SUNStepper) -> SUNErrCode>;
extern "C" {
    pub fn SUNStepper_Create(sunctx: SUNContext, stepper: *mut SUNStepper) -> SUNErrCode;
}
extern "C" {
    pub fn SUNStepper_Destroy(stepper: *mut SUNStepper) -> SUNErrCode;
}
extern "C" {
    pub fn SUNStepper_Evolve(
        stepper: SUNStepper,
        tout: sunrealtype,
        vret: N_Vector,
        tret: *mut sunrealtype,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNStepper_OneStep(
        stepper: SUNStepper,
        tout: sunrealtype,
        vret: N_Vector,
        tret: *mut sunrealtype,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNStepper_FullRhs(
        stepper: SUNStepper,
        t: sunrealtype,
        v: N_Vector,
        f: N_Vector,
        mode: SUNFullRhsMode,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNStepper_ReInit(stepper: SUNStepper, t0: sunrealtype, v0: N_Vector) -> SUNErrCode;
}
extern "C" {
    pub fn SUNStepper_Reset(stepper: SUNStepper, tR: sunrealtype, vR: N_Vector) -> SUNErrCode;
}
extern "C" {
    pub fn SUNStepper_ResetCheckpointIndex(
        stepper: SUNStepper,
        ckptIdxR: suncountertype,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNStepper_SetStopTime(stepper: SUNStepper, tstop: sunrealtype) -> SUNErrCode;
}
extern "C" {
    pub fn SUNStepper_SetStepDirection(stepper: SUNStepper, stepdir: sunrealtype) -> SUNErrCode;
}
extern "C" {
    pub fn SUNStepper_SetForcing(
        stepper: SUNStepper,
        tshift: sunrealtype,
        tscale: sunrealtype,
        forcing: *mut N_Vector,
        nforcing: ::std::os::raw::c_int,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNStepper_SetContent(
        stepper: SUNStepper,
        content: *mut ::std::os::raw::c_void,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNStepper_GetContent(
        stepper: SUNStepper,
        content: *mut *mut ::std::os::raw::c_void,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNStepper_SetLastFlag(
        stepper: SUNStepper,
        last_flag: ::std::os::raw::c_int,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNStepper_GetLastFlag(
        stepper: SUNStepper,
        last_flag: *mut ::std::os::raw::c_int,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNStepper_GetNumSteps(stepper: SUNStepper, nst: *mut suncountertype) -> SUNErrCode;
}
extern "C" {
    pub fn SUNStepper_SetEvolveFn(stepper: SUNStepper, fn_: SUNStepperEvolveFn) -> SUNErrCode;
}
extern "C" {
    pub fn SUNStepper_SetOneStepFn(stepper: SUNStepper, fn_: SUNStepperOneStepFn) -> SUNErrCode;
}
extern "C" {
    pub fn SUNStepper_SetFullRhsFn(stepper: SUNStepper, fn_: SUNStepperFullRhsFn) -> SUNErrCode;
}
extern "C" {
    pub fn SUNStepper_SetReInitFn(stepper: SUNStepper, fn_: SUNStepperReInitFn) -> SUNErrCode;
}
extern "C" {
    pub fn SUNStepper_SetResetFn(stepper: SUNStepper, fn_: SUNStepperResetFn) -> SUNErrCode;
}
extern "C" {
    pub fn SUNStepper_SetResetCheckpointIndexFn(
        stepper: SUNStepper,
        fn_: SUNStepperResetCheckpointIndexFn,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNStepper_SetStopTimeFn(
        stepper: SUNStepper,
        fn_: SUNStepperSetStopTimeFn,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNStepper_SetStepDirectionFn(
        stepper: SUNStepper,
        fn_: SUNStepperSetStepDirectionFn,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNStepper_SetForcingFn(stepper: SUNStepper, fn_: SUNStepperSetForcingFn) -> SUNErrCode;
}
extern "C" {
    pub fn SUNStepper_SetGetNumStepsFn(
        stepper: SUNStepper,
        fn_: SUNStepperGetNumStepsFn,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNStepper_SetDestroyFn(stepper: SUNStepper, fn_: SUNStepperDestroyFn) -> SUNErrCode;
}
pub type SUNAdjRhsFn = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        y: N_Vector,
        sens: N_Vector,
        sens_dot: N_Vector,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SUNAdjointStepper_ {
    _unused: [u8; 0],
}
pub type SUNAdjointStepper = *mut SUNAdjointStepper_;
extern "C" {
    pub fn SUNAdjointStepper_Create(
        fwd_sunstepper: SUNStepper,
        own_fwd: ::std::os::raw::c_int,
        adj_sunstepper: SUNStepper,
        own_adj: ::std::os::raw::c_int,
        final_step_idx: suncountertype,
        tf: sunrealtype,
        sf: N_Vector,
        checkpoint_scheme: SUNAdjointCheckpointScheme,
        sunctx: SUNContext,
        adj_stepper: *mut SUNAdjointStepper,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNAdjointStepper_ReInit(
        adj: SUNAdjointStepper,
        t0: sunrealtype,
        y0: N_Vector,
        tf: sunrealtype,
        sf: N_Vector,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNAdjointStepper_Evolve(
        adj_stepper: SUNAdjointStepper,
        tout: sunrealtype,
        sens: N_Vector,
        tret: *mut sunrealtype,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNAdjointStepper_OneStep(
        adj_stepper: SUNAdjointStepper,
        tout: sunrealtype,
        sens: N_Vector,
        tret: *mut sunrealtype,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNAdjointStepper_RecomputeFwd(
        adj_stepper: SUNAdjointStepper,
        start_idx: suncountertype,
        t0: sunrealtype,
        y0: N_Vector,
        tf: sunrealtype,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNAdjointStepper_SetUserData(
        arg1: SUNAdjointStepper,
        user_data: *mut ::std::os::raw::c_void,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNAdjointStepper_GetNumSteps(
        adj_stepper: SUNAdjointStepper,
        num_steps: *mut suncountertype,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNAdjointStepper_GetNumRecompute(
        adj_stepper: SUNAdjointStepper,
        num_recompute: *mut suncountertype,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNAdjointStepper_PrintAllStats(
        adj_stepper: SUNAdjointStepper,
        outfile: *mut FILE,
        fmt: SUNOutputFormat,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNAdjointStepper_Destroy(arg1: *mut SUNAdjointStepper) -> SUNErrCode;
}
pub const SUNLogLevel_SUN_LOGLEVEL_ALL: SUNLogLevel = -1;
pub const SUNLogLevel_SUN_LOGLEVEL_NONE: SUNLogLevel = 0;
pub const SUNLogLevel_SUN_LOGLEVEL_ERROR: SUNLogLevel = 1;
pub const SUNLogLevel_SUN_LOGLEVEL_WARNING: SUNLogLevel = 2;
pub const SUNLogLevel_SUN_LOGLEVEL_INFO: SUNLogLevel = 3;
pub const SUNLogLevel_SUN_LOGLEVEL_DEBUG: SUNLogLevel = 4;
pub type SUNLogLevel = ::std::os::raw::c_int;
extern "C" {
    pub fn SUNLogger_Create(
        comm: SUNComm,
        output_rank: ::std::os::raw::c_int,
        logger: *mut SUNLogger,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNLogger_CreateFromEnv(comm: SUNComm, logger: *mut SUNLogger) -> SUNErrCode;
}
extern "C" {
    pub fn SUNLogger_SetErrorFilename(
        logger: SUNLogger,
        error_filename: *const ::std::os::raw::c_char,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNLogger_SetWarningFilename(
        logger: SUNLogger,
        warning_filename: *const ::std::os::raw::c_char,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNLogger_SetDebugFilename(
        logger: SUNLogger,
        debug_filename: *const ::std::os::raw::c_char,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNLogger_SetInfoFilename(
        logger: SUNLogger,
        info_filename: *const ::std::os::raw::c_char,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNLogger_QueueMsg(
        logger: SUNLogger,
        lvl: SUNLogLevel,
        scope: *const ::std::os::raw::c_char,
        label: *const ::std::os::raw::c_char,
        msg_txt: *const ::std::os::raw::c_char,
        ...
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNLogger_Flush(logger: SUNLogger, lvl: SUNLogLevel) -> SUNErrCode;
}
extern "C" {
    pub fn SUNLogger_GetOutputRank(
        logger: SUNLogger,
        output_rank: *mut ::std::os::raw::c_int,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNLogger_Destroy(logger: *mut SUNLogger) -> SUNErrCode;
}
extern "C" {
    pub fn SUNIpowerI(
        base: ::std::os::raw::c_int,
        exponent: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SUNRpowerI(base: sunrealtype, exponent: ::std::os::raw::c_int) -> sunrealtype;
}
extern "C" {
    pub fn SUNRCompare(a: sunrealtype, b: sunrealtype) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SUNRCompareTol(
        a: sunrealtype,
        b: sunrealtype,
        tol: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SUNStrToReal(str_: *const ::std::os::raw::c_char) -> sunrealtype;
}
pub const SUNMemoryType_SUNMEMTYPE_HOST: SUNMemoryType = 0;
pub const SUNMemoryType_SUNMEMTYPE_PINNED: SUNMemoryType = 1;
pub const SUNMemoryType_SUNMEMTYPE_DEVICE: SUNMemoryType = 2;
pub const SUNMemoryType_SUNMEMTYPE_UVM: SUNMemoryType = 3;
pub type SUNMemoryType = ::std::os::raw::c_uint;
pub type SUNMemory = *mut SUNMemory_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SUNMemory_ {
    pub ptr: *mut ::std::os::raw::c_void,
    pub type_: SUNMemoryType,
    pub own: ::std::os::raw::c_int,
    pub bytes: usize,
    pub stride: usize,
}
#[test]
fn bindgen_test_layout_SUNMemory_() {
    const UNINIT: ::std::mem::MaybeUninit<SUNMemory_> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SUNMemory_>(),
        32usize,
        concat!("Size of: ", stringify!(SUNMemory_))
    );
    assert_eq!(
        ::std::mem::align_of::<SUNMemory_>(),
        8usize,
        concat!("Alignment of ", stringify!(SUNMemory_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ptr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SUNMemory_),
            "::",
            stringify!(ptr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).type_) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SUNMemory_),
            "::",
            stringify!(type_)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).own) as usize - ptr as usize },
        12usize,
        concat!(
            "Offset of field: ",
            stringify!(SUNMemory_),
            "::",
            stringify!(own)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).bytes) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SUNMemory_),
            "::",
            stringify!(bytes)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).stride) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SUNMemory_),
            "::",
            stringify!(stride)
        )
    );
}
impl Default for SUNMemory_ {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn SUNMemoryNewEmpty(sunctx: SUNContext) -> SUNMemory;
}
pub type SUNMemoryHelper_Ops = *mut SUNMemoryHelper_Ops_;
pub type SUNMemoryHelper = *mut SUNMemoryHelper_;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct SUNMemoryHelper_ {
    pub content: *mut ::std::os::raw::c_void,
    pub queue: *mut ::std::os::raw::c_void,
    pub ops: SUNMemoryHelper_Ops,
    pub sunctx: SUNContext,
}
#[test]
fn bindgen_test_layout_SUNMemoryHelper_() {
    const UNINIT: ::std::mem::MaybeUninit<SUNMemoryHelper_> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SUNMemoryHelper_>(),
        32usize,
        concat!("Size of: ", stringify!(SUNMemoryHelper_))
    );
    assert_eq!(
        ::std::mem::align_of::<SUNMemoryHelper_>(),
        8usize,
        concat!("Alignment of ", stringify!(SUNMemoryHelper_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).content) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SUNMemoryHelper_),
            "::",
            stringify!(content)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).queue) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SUNMemoryHelper_),
            "::",
            stringify!(queue)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ops) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SUNMemoryHelper_),
            "::",
            stringify!(ops)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sunctx) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SUNMemoryHelper_),
            "::",
            stringify!(sunctx)
        )
    );
}
impl Default for SUNMemoryHelper_ {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct SUNMemoryHelper_Ops_ {
    pub alloc: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: SUNMemoryHelper,
            memptr: *mut SUNMemory,
            mem_size: usize,
            mem_type: SUNMemoryType,
            queue: *mut ::std::os::raw::c_void,
        ) -> SUNErrCode,
    >,
    pub dealloc: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: SUNMemoryHelper,
            mem: SUNMemory,
            queue: *mut ::std::os::raw::c_void,
        ) -> SUNErrCode,
    >,
    pub copy: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: SUNMemoryHelper,
            dst: SUNMemory,
            src: SUNMemory,
            mem_size: usize,
            queue: *mut ::std::os::raw::c_void,
        ) -> SUNErrCode,
    >,
    pub allocstrided: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: SUNMemoryHelper,
            memptr: *mut SUNMemory,
            mem_size: usize,
            stride: usize,
            mem_type: SUNMemoryType,
            queue: *mut ::std::os::raw::c_void,
        ) -> SUNErrCode,
    >,
    pub copyasync: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: SUNMemoryHelper,
            dst: SUNMemory,
            src: SUNMemory,
            mem_size: usize,
            queue: *mut ::std::os::raw::c_void,
        ) -> SUNErrCode,
    >,
    pub getallocstats: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: SUNMemoryHelper,
            mem_type: SUNMemoryType,
            num_allocations: *mut ::std::os::raw::c_ulong,
            num_deallocations: *mut ::std::os::raw::c_ulong,
            bytes_allocated: *mut usize,
            bytes_high_watermark: *mut usize,
        ) -> SUNErrCode,
    >,
    pub clone:
        ::std::option::Option<unsafe extern "C" fn(arg1: SUNMemoryHelper) -> SUNMemoryHelper>,
    pub destroy: ::std::option::Option<unsafe extern "C" fn(arg1: SUNMemoryHelper) -> SUNErrCode>,
}
#[test]
fn bindgen_test_layout_SUNMemoryHelper_Ops_() {
    const UNINIT: ::std::mem::MaybeUninit<SUNMemoryHelper_Ops_> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<SUNMemoryHelper_Ops_>(),
        64usize,
        concat!("Size of: ", stringify!(SUNMemoryHelper_Ops_))
    );
    assert_eq!(
        ::std::mem::align_of::<SUNMemoryHelper_Ops_>(),
        8usize,
        concat!("Alignment of ", stringify!(SUNMemoryHelper_Ops_))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).alloc) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(SUNMemoryHelper_Ops_),
            "::",
            stringify!(alloc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).dealloc) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(SUNMemoryHelper_Ops_),
            "::",
            stringify!(dealloc)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).copy) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(SUNMemoryHelper_Ops_),
            "::",
            stringify!(copy)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).allocstrided) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(SUNMemoryHelper_Ops_),
            "::",
            stringify!(allocstrided)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).copyasync) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(SUNMemoryHelper_Ops_),
            "::",
            stringify!(copyasync)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getallocstats) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(SUNMemoryHelper_Ops_),
            "::",
            stringify!(getallocstats)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).clone) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(SUNMemoryHelper_Ops_),
            "::",
            stringify!(clone)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).destroy) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(SUNMemoryHelper_Ops_),
            "::",
            stringify!(destroy)
        )
    );
}
extern "C" {
    pub fn SUNMemoryHelper_Alias(arg1: SUNMemoryHelper, mem: SUNMemory) -> SUNMemory;
}
extern "C" {
    pub fn SUNMemoryHelper_Wrap(
        arg1: SUNMemoryHelper,
        ptr: *mut ::std::os::raw::c_void,
        mem_type: SUNMemoryType,
    ) -> SUNMemory;
}
extern "C" {
    pub fn SUNMemoryHelper_Alloc(
        arg1: SUNMemoryHelper,
        memptr: *mut SUNMemory,
        mem_size: usize,
        mem_type: SUNMemoryType,
        queue: *mut ::std::os::raw::c_void,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNMemoryHelper_AllocStrided(
        arg1: SUNMemoryHelper,
        memptr: *mut SUNMemory,
        mem_size: usize,
        stride: usize,
        mem_type: SUNMemoryType,
        queue: *mut ::std::os::raw::c_void,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNMemoryHelper_Dealloc(
        arg1: SUNMemoryHelper,
        mem: SUNMemory,
        queue: *mut ::std::os::raw::c_void,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNMemoryHelper_Copy(
        arg1: SUNMemoryHelper,
        dst: SUNMemory,
        src: SUNMemory,
        mem_size: usize,
        queue: *mut ::std::os::raw::c_void,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNMemoryHelper_CopyAsync(
        arg1: SUNMemoryHelper,
        dst: SUNMemory,
        src: SUNMemory,
        mem_size: usize,
        queue: *mut ::std::os::raw::c_void,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNMemoryHelper_GetAllocStats(
        arg1: SUNMemoryHelper,
        mem_type: SUNMemoryType,
        num_allocations: *mut ::std::os::raw::c_ulong,
        num_deallocations: *mut ::std::os::raw::c_ulong,
        bytes_allocated: *mut usize,
        bytes_high_watermark: *mut usize,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNMemoryHelper_Clone(arg1: SUNMemoryHelper) -> SUNMemoryHelper;
}
extern "C" {
    pub fn SUNMemoryHelper_Destroy(arg1: SUNMemoryHelper) -> SUNErrCode;
}
extern "C" {
    pub fn SUNMemoryHelper_SetDefaultQueue(
        arg1: SUNMemoryHelper,
        queue: *mut ::std::os::raw::c_void,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNMemoryHelper_NewEmpty(sunctx: SUNContext) -> SUNMemoryHelper;
}
extern "C" {
    pub fn SUNMemoryHelper_CopyOps(src: SUNMemoryHelper, dst: SUNMemoryHelper) -> SUNErrCode;
}
extern "C" {
    pub fn SUNMemoryHelper_ImplementsRequiredOps(arg1: SUNMemoryHelper) -> ::std::os::raw::c_int;
}
pub type SUNNonlinearSolver_Ops = *mut _generic_SUNNonlinearSolver_Ops;
pub type SUNNonlinearSolver = *mut _generic_SUNNonlinearSolver;
pub type SUNNonlinSolSysFn = ::std::option::Option<
    unsafe extern "C" fn(
        y: N_Vector,
        F: N_Vector,
        mem: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type SUNNonlinSolLSetupFn = ::std::option::Option<
    unsafe extern "C" fn(
        jbad: ::std::os::raw::c_int,
        jcur: *mut ::std::os::raw::c_int,
        mem: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type SUNNonlinSolLSolveFn = ::std::option::Option<
    unsafe extern "C" fn(b: N_Vector, mem: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int,
>;
pub type SUNNonlinSolConvTestFn = ::std::option::Option<
    unsafe extern "C" fn(
        NLS: SUNNonlinearSolver,
        y: N_Vector,
        del: N_Vector,
        tol: sunrealtype,
        ewt: N_Vector,
        mem: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub const SUNNonlinearSolver_Type_SUNNONLINEARSOLVER_ROOTFIND: SUNNonlinearSolver_Type = 0;
pub const SUNNonlinearSolver_Type_SUNNONLINEARSOLVER_FIXEDPOINT: SUNNonlinearSolver_Type = 1;
pub type SUNNonlinearSolver_Type = ::std::os::raw::c_uint;
#[repr(C)]
#[derive(Debug, Default, Copy, Clone)]
pub struct _generic_SUNNonlinearSolver_Ops {
    pub gettype: ::std::option::Option<
        unsafe extern "C" fn(arg1: SUNNonlinearSolver) -> SUNNonlinearSolver_Type,
    >,
    pub initialize:
        ::std::option::Option<unsafe extern "C" fn(arg1: SUNNonlinearSolver) -> SUNErrCode>,
    pub setup: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: SUNNonlinearSolver,
            arg2: N_Vector,
            arg3: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
    pub solve: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: SUNNonlinearSolver,
            arg2: N_Vector,
            arg3: N_Vector,
            arg4: N_Vector,
            arg5: sunrealtype,
            arg6: ::std::os::raw::c_int,
            arg7: *mut ::std::os::raw::c_void,
        ) -> ::std::os::raw::c_int,
    >,
    pub free: ::std::option::Option<unsafe extern "C" fn(arg1: SUNNonlinearSolver) -> SUNErrCode>,
    pub setsysfn: ::std::option::Option<
        unsafe extern "C" fn(arg1: SUNNonlinearSolver, arg2: SUNNonlinSolSysFn) -> SUNErrCode,
    >,
    pub setlsetupfn: ::std::option::Option<
        unsafe extern "C" fn(arg1: SUNNonlinearSolver, arg2: SUNNonlinSolLSetupFn) -> SUNErrCode,
    >,
    pub setlsolvefn: ::std::option::Option<
        unsafe extern "C" fn(arg1: SUNNonlinearSolver, arg2: SUNNonlinSolLSolveFn) -> SUNErrCode,
    >,
    pub setctestfn: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: SUNNonlinearSolver,
            arg2: SUNNonlinSolConvTestFn,
            arg3: *mut ::std::os::raw::c_void,
        ) -> SUNErrCode,
    >,
    pub setmaxiters: ::std::option::Option<
        unsafe extern "C" fn(arg1: SUNNonlinearSolver, arg2: ::std::os::raw::c_int) -> SUNErrCode,
    >,
    pub getnumiters: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: SUNNonlinearSolver,
            arg2: *mut ::std::os::raw::c_long,
        ) -> SUNErrCode,
    >,
    pub getcuriter: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: SUNNonlinearSolver,
            arg2: *mut ::std::os::raw::c_int,
        ) -> SUNErrCode,
    >,
    pub getnumconvfails: ::std::option::Option<
        unsafe extern "C" fn(
            arg1: SUNNonlinearSolver,
            arg2: *mut ::std::os::raw::c_long,
        ) -> SUNErrCode,
    >,
}
#[test]
fn bindgen_test_layout__generic_SUNNonlinearSolver_Ops() {
    const UNINIT: ::std::mem::MaybeUninit<_generic_SUNNonlinearSolver_Ops> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_generic_SUNNonlinearSolver_Ops>(),
        104usize,
        concat!("Size of: ", stringify!(_generic_SUNNonlinearSolver_Ops))
    );
    assert_eq!(
        ::std::mem::align_of::<_generic_SUNNonlinearSolver_Ops>(),
        8usize,
        concat!("Alignment of ", stringify!(_generic_SUNNonlinearSolver_Ops))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).gettype) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNNonlinearSolver_Ops),
            "::",
            stringify!(gettype)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).initialize) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNNonlinearSolver_Ops),
            "::",
            stringify!(initialize)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).setup) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNNonlinearSolver_Ops),
            "::",
            stringify!(setup)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).solve) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNNonlinearSolver_Ops),
            "::",
            stringify!(solve)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).free) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNNonlinearSolver_Ops),
            "::",
            stringify!(free)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).setsysfn) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNNonlinearSolver_Ops),
            "::",
            stringify!(setsysfn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).setlsetupfn) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNNonlinearSolver_Ops),
            "::",
            stringify!(setlsetupfn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).setlsolvefn) as usize - ptr as usize },
        56usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNNonlinearSolver_Ops),
            "::",
            stringify!(setlsolvefn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).setctestfn) as usize - ptr as usize },
        64usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNNonlinearSolver_Ops),
            "::",
            stringify!(setctestfn)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).setmaxiters) as usize - ptr as usize },
        72usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNNonlinearSolver_Ops),
            "::",
            stringify!(setmaxiters)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getnumiters) as usize - ptr as usize },
        80usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNNonlinearSolver_Ops),
            "::",
            stringify!(getnumiters)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getcuriter) as usize - ptr as usize },
        88usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNNonlinearSolver_Ops),
            "::",
            stringify!(getcuriter)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).getnumconvfails) as usize - ptr as usize },
        96usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNNonlinearSolver_Ops),
            "::",
            stringify!(getnumconvfails)
        )
    );
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct _generic_SUNNonlinearSolver {
    pub content: *mut ::std::os::raw::c_void,
    pub ops: SUNNonlinearSolver_Ops,
    pub sunctx: SUNContext,
}
#[test]
fn bindgen_test_layout__generic_SUNNonlinearSolver() {
    const UNINIT: ::std::mem::MaybeUninit<_generic_SUNNonlinearSolver> =
        ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<_generic_SUNNonlinearSolver>(),
        24usize,
        concat!("Size of: ", stringify!(_generic_SUNNonlinearSolver))
    );
    assert_eq!(
        ::std::mem::align_of::<_generic_SUNNonlinearSolver>(),
        8usize,
        concat!("Alignment of ", stringify!(_generic_SUNNonlinearSolver))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).content) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNNonlinearSolver),
            "::",
            stringify!(content)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).ops) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNNonlinearSolver),
            "::",
            stringify!(ops)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).sunctx) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(_generic_SUNNonlinearSolver),
            "::",
            stringify!(sunctx)
        )
    );
}
impl Default for _generic_SUNNonlinearSolver {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn SUNNonlinSolNewEmpty(sunctx: SUNContext) -> SUNNonlinearSolver;
}
extern "C" {
    pub fn SUNNonlinSolFreeEmpty(NLS: SUNNonlinearSolver);
}
extern "C" {
    pub fn SUNNonlinSolGetType(NLS: SUNNonlinearSolver) -> SUNNonlinearSolver_Type;
}
extern "C" {
    pub fn SUNNonlinSolInitialize(NLS: SUNNonlinearSolver) -> SUNErrCode;
}
extern "C" {
    pub fn SUNNonlinSolSetup(
        NLS: SUNNonlinearSolver,
        y: N_Vector,
        mem: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SUNNonlinSolSolve(
        NLS: SUNNonlinearSolver,
        y0: N_Vector,
        y: N_Vector,
        w: N_Vector,
        tol: sunrealtype,
        callLSetup: ::std::os::raw::c_int,
        mem: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn SUNNonlinSolFree(NLS: SUNNonlinearSolver) -> SUNErrCode;
}
extern "C" {
    pub fn SUNNonlinSolSetSysFn(NLS: SUNNonlinearSolver, SysFn: SUNNonlinSolSysFn) -> SUNErrCode;
}
extern "C" {
    pub fn SUNNonlinSolSetLSetupFn(
        NLS: SUNNonlinearSolver,
        SetupFn: SUNNonlinSolLSetupFn,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNNonlinSolSetLSolveFn(
        NLS: SUNNonlinearSolver,
        SolveFn: SUNNonlinSolLSolveFn,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNNonlinSolSetConvTestFn(
        NLS: SUNNonlinearSolver,
        CTestFn: SUNNonlinSolConvTestFn,
        ctest_data: *mut ::std::os::raw::c_void,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNNonlinSolSetMaxIters(
        NLS: SUNNonlinearSolver,
        maxiters: ::std::os::raw::c_int,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNNonlinSolGetNumIters(
        NLS: SUNNonlinearSolver,
        niters: *mut ::std::os::raw::c_long,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNNonlinSolGetCurIter(
        NLS: SUNNonlinearSolver,
        iter: *mut ::std::os::raw::c_int,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNNonlinSolGetNumConvFails(
        NLS: SUNNonlinearSolver,
        nconvfails: *mut ::std::os::raw::c_long,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNProfiler_Create(
        comm: SUNComm,
        title: *const ::std::os::raw::c_char,
        p: *mut SUNProfiler,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNProfiler_Free(p: *mut SUNProfiler) -> SUNErrCode;
}
extern "C" {
    pub fn SUNProfiler_Begin(p: SUNProfiler, name: *const ::std::os::raw::c_char) -> SUNErrCode;
}
extern "C" {
    pub fn SUNProfiler_End(p: SUNProfiler, name: *const ::std::os::raw::c_char) -> SUNErrCode;
}
extern "C" {
    pub fn SUNProfiler_GetTimerResolution(p: SUNProfiler, resolution: *mut f64) -> SUNErrCode;
}
extern "C" {
    pub fn SUNProfiler_GetElapsedTime(
        p: SUNProfiler,
        name: *const ::std::os::raw::c_char,
        time: *mut f64,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNProfiler_Print(p: SUNProfiler, fp: *mut FILE) -> SUNErrCode;
}
extern "C" {
    pub fn SUNProfiler_Reset(p: SUNProfiler) -> SUNErrCode;
}
extern "C" {
    pub fn SUNDIALSGetVersion(
        version: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_int,
    ) -> SUNErrCode;
}
extern "C" {
    pub fn SUNDIALSGetVersionNumber(
        major: *mut ::std::os::raw::c_int,
        minor: *mut ::std::os::raw::c_int,
        patch: *mut ::std::os::raw::c_int,
        label: *mut ::std::os::raw::c_char,
        len: ::std::os::raw::c_int,
    ) -> SUNErrCode;
}
pub type CVRhsFn = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        y: N_Vector,
        ydot: N_Vector,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type CVRootFn = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        y: N_Vector,
        gout: *mut sunrealtype,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type CVEwtFn = ::std::option::Option<
    unsafe extern "C" fn(
        y: N_Vector,
        ewt: N_Vector,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type CVMonitorFn = ::std::option::Option<
    unsafe extern "C" fn(
        cvode_mem: *mut ::std::os::raw::c_void,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn CVodeCreate(
        lmm: ::std::os::raw::c_int,
        sunctx: SUNContext,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn CVodeInit(
        cvode_mem: *mut ::std::os::raw::c_void,
        f: CVRhsFn,
        t0: sunrealtype,
        y0: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeReInit(
        cvode_mem: *mut ::std::os::raw::c_void,
        t0: sunrealtype,
        y0: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeResizeHistory(
        cvode_mem: *mut ::std::os::raw::c_void,
        t_hist: *mut sunrealtype,
        y_hist: *mut N_Vector,
        f_hist: *mut N_Vector,
        num_y_hist: ::std::os::raw::c_int,
        num_f_hist: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSStolerances(
        cvode_mem: *mut ::std::os::raw::c_void,
        reltol: sunrealtype,
        abstol: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSVtolerances(
        cvode_mem: *mut ::std::os::raw::c_void,
        reltol: sunrealtype,
        abstol: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeWFtolerances(
        cvode_mem: *mut ::std::os::raw::c_void,
        efun: CVEwtFn,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetConstraints(
        cvode_mem: *mut ::std::os::raw::c_void,
        constraints: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetDeltaGammaMaxLSetup(
        cvode_mem: *mut ::std::os::raw::c_void,
        dgmax_lsetup: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetInitStep(
        cvode_mem: *mut ::std::os::raw::c_void,
        hin: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetLSetupFrequency(
        cvode_mem: *mut ::std::os::raw::c_void,
        msbp: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetMaxConvFails(
        cvode_mem: *mut ::std::os::raw::c_void,
        maxncf: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetMaxErrTestFails(
        cvode_mem: *mut ::std::os::raw::c_void,
        maxnef: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetMaxHnilWarns(
        cvode_mem: *mut ::std::os::raw::c_void,
        mxhnil: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetMaxNonlinIters(
        cvode_mem: *mut ::std::os::raw::c_void,
        maxcor: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetMaxNumSteps(
        cvode_mem: *mut ::std::os::raw::c_void,
        mxsteps: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetMaxOrd(
        cvode_mem: *mut ::std::os::raw::c_void,
        maxord: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetMaxStep(
        cvode_mem: *mut ::std::os::raw::c_void,
        hmax: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetMinStep(
        cvode_mem: *mut ::std::os::raw::c_void,
        hmin: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetMonitorFn(
        cvode_mem: *mut ::std::os::raw::c_void,
        fn_: CVMonitorFn,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetMonitorFrequency(
        cvode_mem: *mut ::std::os::raw::c_void,
        nst: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetNlsRhsFn(
        cvode_mem: *mut ::std::os::raw::c_void,
        f: CVRhsFn,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetNonlinConvCoef(
        cvode_mem: *mut ::std::os::raw::c_void,
        nlscoef: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetNonlinearSolver(
        cvode_mem: *mut ::std::os::raw::c_void,
        NLS: SUNNonlinearSolver,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetStabLimDet(
        cvode_mem: *mut ::std::os::raw::c_void,
        stldet: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetStopTime(
        cvode_mem: *mut ::std::os::raw::c_void,
        tstop: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetInterpolateStopTime(
        cvode_mem: *mut ::std::os::raw::c_void,
        interp: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeClearStopTime(cvode_mem: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetUseIntegratorFusedKernels(
        cvode_mem: *mut ::std::os::raw::c_void,
        onoff: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetUserData(
        cvode_mem: *mut ::std::os::raw::c_void,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetEtaFixedStepBounds(
        cvode_mem: *mut ::std::os::raw::c_void,
        eta_min_fx: sunrealtype,
        eta_max_fx: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetEtaMaxFirstStep(
        cvode_mem: *mut ::std::os::raw::c_void,
        eta_max_fs: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetEtaMaxEarlyStep(
        cvode_mem: *mut ::std::os::raw::c_void,
        eta_max_es: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetNumStepsEtaMaxEarlyStep(
        cvode_mem: *mut ::std::os::raw::c_void,
        small_nst: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetEtaMax(
        cvode_mem: *mut ::std::os::raw::c_void,
        eta_max_gs: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetEtaMin(
        cvode_mem: *mut ::std::os::raw::c_void,
        eta_min: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetEtaMinErrFail(
        cvode_mem: *mut ::std::os::raw::c_void,
        eta_min_ef: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetEtaMaxErrFail(
        cvode_mem: *mut ::std::os::raw::c_void,
        eta_max_ef: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetNumFailsEtaMaxErrFail(
        cvode_mem: *mut ::std::os::raw::c_void,
        small_nef: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetEtaConvFail(
        cvode_mem: *mut ::std::os::raw::c_void,
        eta_cf: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeRootInit(
        cvode_mem: *mut ::std::os::raw::c_void,
        nrtfn: ::std::os::raw::c_int,
        g: CVRootFn,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetRootDirection(
        cvode_mem: *mut ::std::os::raw::c_void,
        rootdir: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetNoInactiveRootWarn(
        cvode_mem: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVode(
        cvode_mem: *mut ::std::os::raw::c_void,
        tout: sunrealtype,
        yout: N_Vector,
        tret: *mut sunrealtype,
        itask: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeComputeState(
        cvode_mem: *mut ::std::os::raw::c_void,
        ycor: N_Vector,
        y: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetDky(
        cvode_mem: *mut ::std::os::raw::c_void,
        t: sunrealtype,
        k: ::std::os::raw::c_int,
        dky: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetWorkSpace(
        cvode_mem: *mut ::std::os::raw::c_void,
        lenrw: *mut ::std::os::raw::c_long,
        leniw: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetNumSteps(
        cvode_mem: *mut ::std::os::raw::c_void,
        nsteps: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetNumRhsEvals(
        cvode_mem: *mut ::std::os::raw::c_void,
        nfevals: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetNumLinSolvSetups(
        cvode_mem: *mut ::std::os::raw::c_void,
        nlinsetups: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetNumErrTestFails(
        cvode_mem: *mut ::std::os::raw::c_void,
        netfails: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetLastOrder(
        cvode_mem: *mut ::std::os::raw::c_void,
        qlast: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetCurrentOrder(
        cvode_mem: *mut ::std::os::raw::c_void,
        qcur: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetCurrentGamma(
        cvode_mem: *mut ::std::os::raw::c_void,
        gamma: *mut sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetNumStabLimOrderReds(
        cvode_mem: *mut ::std::os::raw::c_void,
        nslred: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetActualInitStep(
        cvode_mem: *mut ::std::os::raw::c_void,
        hinused: *mut sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetLastStep(
        cvode_mem: *mut ::std::os::raw::c_void,
        hlast: *mut sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetCurrentStep(
        cvode_mem: *mut ::std::os::raw::c_void,
        hcur: *mut sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetCurrentState(
        cvode_mem: *mut ::std::os::raw::c_void,
        y: *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetCurrentTime(
        cvode_mem: *mut ::std::os::raw::c_void,
        tcur: *mut sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetTolScaleFactor(
        cvode_mem: *mut ::std::os::raw::c_void,
        tolsfac: *mut sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetErrWeights(
        cvode_mem: *mut ::std::os::raw::c_void,
        eweight: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetEstLocalErrors(
        cvode_mem: *mut ::std::os::raw::c_void,
        ele: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetNumGEvals(
        cvode_mem: *mut ::std::os::raw::c_void,
        ngevals: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetRootInfo(
        cvode_mem: *mut ::std::os::raw::c_void,
        rootsfound: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetIntegratorStats(
        cvode_mem: *mut ::std::os::raw::c_void,
        nsteps: *mut ::std::os::raw::c_long,
        nfevals: *mut ::std::os::raw::c_long,
        nlinsetups: *mut ::std::os::raw::c_long,
        netfails: *mut ::std::os::raw::c_long,
        qlast: *mut ::std::os::raw::c_int,
        qcur: *mut ::std::os::raw::c_int,
        hinused: *mut sunrealtype,
        hlast: *mut sunrealtype,
        hcur: *mut sunrealtype,
        tcur: *mut sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetNonlinearSystemData(
        cvode_mem: *mut ::std::os::raw::c_void,
        tcur: *mut sunrealtype,
        ypred: *mut N_Vector,
        yn: *mut N_Vector,
        fn_: *mut N_Vector,
        gamma: *mut sunrealtype,
        rl1: *mut sunrealtype,
        zn1: *mut N_Vector,
        user_data: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetNumNonlinSolvIters(
        cvode_mem: *mut ::std::os::raw::c_void,
        nniters: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetNumNonlinSolvConvFails(
        cvode_mem: *mut ::std::os::raw::c_void,
        nnfails: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetNonlinSolvStats(
        cvode_mem: *mut ::std::os::raw::c_void,
        nniters: *mut ::std::os::raw::c_long,
        nnfails: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetNumStepSolveFails(
        cvode_mem: *mut ::std::os::raw::c_void,
        nncfails: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetUserData(
        cvode_mem: *mut ::std::os::raw::c_void,
        user_data: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodePrintAllStats(
        cvode_mem: *mut ::std::os::raw::c_void,
        outfile: *mut FILE,
        fmt: SUNOutputFormat,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetReturnFlagName(flag: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn CVodeFree(cvode_mem: *mut *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn CVodeSetJacTimesRhsFn(
        cvode_mem: *mut ::std::os::raw::c_void,
        jtimesRhsFn: CVRhsFn,
    ) -> ::std::os::raw::c_int;
}
pub type CVLsJacFnB = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        y: N_Vector,
        yB: N_Vector,
        fyB: N_Vector,
        JB: SUNMatrix,
        user_dataB: *mut ::std::os::raw::c_void,
        tmp1B: N_Vector,
        tmp2B: N_Vector,
        tmp3B: N_Vector,
    ) -> ::std::os::raw::c_int,
>;
pub type CVLsJacFnBS = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        y: N_Vector,
        yS: *mut N_Vector,
        yB: N_Vector,
        fyB: N_Vector,
        JB: SUNMatrix,
        user_dataB: *mut ::std::os::raw::c_void,
        tmp1B: N_Vector,
        tmp2B: N_Vector,
        tmp3B: N_Vector,
    ) -> ::std::os::raw::c_int,
>;
pub type CVLsPrecSetupFnB = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        y: N_Vector,
        yB: N_Vector,
        fyB: N_Vector,
        jokB: ::std::os::raw::c_int,
        jcurPtrB: *mut ::std::os::raw::c_int,
        gammaB: sunrealtype,
        user_dataB: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type CVLsPrecSetupFnBS = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        y: N_Vector,
        yS: *mut N_Vector,
        yB: N_Vector,
        fyB: N_Vector,
        jokB: ::std::os::raw::c_int,
        jcurPtrB: *mut ::std::os::raw::c_int,
        gammaB: sunrealtype,
        user_dataB: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type CVLsPrecSolveFnB = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        y: N_Vector,
        yB: N_Vector,
        fyB: N_Vector,
        rB: N_Vector,
        zB: N_Vector,
        gammaB: sunrealtype,
        deltaB: sunrealtype,
        lrB: ::std::os::raw::c_int,
        user_dataB: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type CVLsPrecSolveFnBS = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        y: N_Vector,
        yS: *mut N_Vector,
        yB: N_Vector,
        fyB: N_Vector,
        rB: N_Vector,
        zB: N_Vector,
        gammaB: sunrealtype,
        deltaB: sunrealtype,
        lrB: ::std::os::raw::c_int,
        user_dataB: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type CVLsJacTimesSetupFnB = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        y: N_Vector,
        yB: N_Vector,
        fyB: N_Vector,
        jac_dataB: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type CVLsJacTimesSetupFnBS = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        y: N_Vector,
        yS: *mut N_Vector,
        yB: N_Vector,
        fyB: N_Vector,
        jac_dataB: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type CVLsJacTimesVecFnB = ::std::option::Option<
    unsafe extern "C" fn(
        vB: N_Vector,
        JvB: N_Vector,
        t: sunrealtype,
        y: N_Vector,
        yB: N_Vector,
        fyB: N_Vector,
        jac_dataB: *mut ::std::os::raw::c_void,
        tmpB: N_Vector,
    ) -> ::std::os::raw::c_int,
>;
pub type CVLsJacTimesVecFnBS = ::std::option::Option<
    unsafe extern "C" fn(
        vB: N_Vector,
        JvB: N_Vector,
        t: sunrealtype,
        y: N_Vector,
        yS: *mut N_Vector,
        yB: N_Vector,
        fyB: N_Vector,
        jac_dataB: *mut ::std::os::raw::c_void,
        tmpB: N_Vector,
    ) -> ::std::os::raw::c_int,
>;
pub type CVLsLinSysFnB = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        y: N_Vector,
        yB: N_Vector,
        fyB: N_Vector,
        AB: SUNMatrix,
        jokB: ::std::os::raw::c_int,
        jcurB: *mut ::std::os::raw::c_int,
        gammaB: sunrealtype,
        user_dataB: *mut ::std::os::raw::c_void,
        tmp1B: N_Vector,
        tmp2B: N_Vector,
        tmp3B: N_Vector,
    ) -> ::std::os::raw::c_int,
>;
pub type CVLsLinSysFnBS = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        y: N_Vector,
        yS: *mut N_Vector,
        yB: N_Vector,
        fyB: N_Vector,
        AB: SUNMatrix,
        jokB: ::std::os::raw::c_int,
        jcurB: *mut ::std::os::raw::c_int,
        gammaB: sunrealtype,
        user_dataB: *mut ::std::os::raw::c_void,
        tmp1B: N_Vector,
        tmp2B: N_Vector,
        tmp3B: N_Vector,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn CVodeSetLinearSolverB(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        LS: SUNLinearSolver,
        A: SUNMatrix,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetJacFnB(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        jacB: CVLsJacFnB,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetJacFnBS(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        jacBS: CVLsJacFnBS,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetEpsLinB(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        eplifacB: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetLSNormFactorB(
        arkode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        nrmfacB: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetLinearSolutionScalingB(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        onoffB: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetPreconditionerB(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        psetB: CVLsPrecSetupFnB,
        psolveB: CVLsPrecSolveFnB,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetPreconditionerBS(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        psetBS: CVLsPrecSetupFnBS,
        psolveBS: CVLsPrecSolveFnBS,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetJacTimesB(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        jtsetupB: CVLsJacTimesSetupFnB,
        jtimesB: CVLsJacTimesVecFnB,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetJacTimesBS(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        jtsetupBS: CVLsJacTimesSetupFnBS,
        jtimesBS: CVLsJacTimesVecFnBS,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetLinSysFnB(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        linsys: CVLsLinSysFnB,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetLinSysFnBS(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        linsys: CVLsLinSysFnBS,
    ) -> ::std::os::raw::c_int;
}
pub type CVQuadRhsFn = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        y: N_Vector,
        yQdot: N_Vector,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type CVSensRhsFn = ::std::option::Option<
    unsafe extern "C" fn(
        Ns: ::std::os::raw::c_int,
        t: sunrealtype,
        y: N_Vector,
        ydot: N_Vector,
        yS: *mut N_Vector,
        ySdot: *mut N_Vector,
        user_data: *mut ::std::os::raw::c_void,
        tmp1: N_Vector,
        tmp2: N_Vector,
    ) -> ::std::os::raw::c_int,
>;
pub type CVSensRhs1Fn = ::std::option::Option<
    unsafe extern "C" fn(
        Ns: ::std::os::raw::c_int,
        t: sunrealtype,
        y: N_Vector,
        ydot: N_Vector,
        iS: ::std::os::raw::c_int,
        yS: N_Vector,
        ySdot: N_Vector,
        user_data: *mut ::std::os::raw::c_void,
        tmp1: N_Vector,
        tmp2: N_Vector,
    ) -> ::std::os::raw::c_int,
>;
pub type CVQuadSensRhsFn = ::std::option::Option<
    unsafe extern "C" fn(
        Ns: ::std::os::raw::c_int,
        t: sunrealtype,
        y: N_Vector,
        yS: *mut N_Vector,
        yQdot: N_Vector,
        yQSdot: *mut N_Vector,
        user_data: *mut ::std::os::raw::c_void,
        tmp: N_Vector,
        tmpQ: N_Vector,
    ) -> ::std::os::raw::c_int,
>;
pub type CVRhsFnB = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        y: N_Vector,
        yB: N_Vector,
        yBdot: N_Vector,
        user_dataB: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type CVRhsFnBS = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        y: N_Vector,
        yS: *mut N_Vector,
        yB: N_Vector,
        yBdot: N_Vector,
        user_dataB: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type CVQuadRhsFnB = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        y: N_Vector,
        yB: N_Vector,
        qBdot: N_Vector,
        user_dataB: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type CVQuadRhsFnBS = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        y: N_Vector,
        yS: *mut N_Vector,
        yB: N_Vector,
        qBdot: N_Vector,
        user_dataB: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn CVodeComputeStateSens(
        cvode_mem: *mut ::std::os::raw::c_void,
        yScor: *mut N_Vector,
        yS: *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeComputeStateSens1(
        cvode_mem: *mut ::std::os::raw::c_void,
        idx: ::std::os::raw::c_int,
        yScor1: N_Vector,
        yS1: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetCurrentStateSens(
        cvode_mem: *mut ::std::os::raw::c_void,
        yS: *mut *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetCurrentSensSolveIndex(
        cvode_mem: *mut ::std::os::raw::c_void,
        index: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetNonlinearSystemDataSens(
        cvode_mem: *mut ::std::os::raw::c_void,
        tcur: *mut sunrealtype,
        ySpred: *mut *mut N_Vector,
        ySn: *mut *mut N_Vector,
        gamma: *mut sunrealtype,
        rl1: *mut sunrealtype,
        zn1: *mut *mut N_Vector,
        user_data: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeQuadInit(
        cvode_mem: *mut ::std::os::raw::c_void,
        fQ: CVQuadRhsFn,
        yQ0: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeQuadReInit(
        cvode_mem: *mut ::std::os::raw::c_void,
        yQ0: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeQuadSStolerances(
        cvode_mem: *mut ::std::os::raw::c_void,
        reltolQ: sunrealtype,
        abstolQ: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeQuadSVtolerances(
        cvode_mem: *mut ::std::os::raw::c_void,
        reltolQ: sunrealtype,
        abstolQ: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetQuadErrCon(
        cvode_mem: *mut ::std::os::raw::c_void,
        errconQ: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetQuad(
        cvode_mem: *mut ::std::os::raw::c_void,
        tret: *mut sunrealtype,
        yQout: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetQuadDky(
        cvode_mem: *mut ::std::os::raw::c_void,
        t: sunrealtype,
        k: ::std::os::raw::c_int,
        dky: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetQuadNumRhsEvals(
        cvode_mem: *mut ::std::os::raw::c_void,
        nfQevals: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetQuadNumErrTestFails(
        cvode_mem: *mut ::std::os::raw::c_void,
        nQetfails: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetQuadErrWeights(
        cvode_mem: *mut ::std::os::raw::c_void,
        eQweight: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetQuadStats(
        cvode_mem: *mut ::std::os::raw::c_void,
        nfQevals: *mut ::std::os::raw::c_long,
        nQetfails: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeQuadFree(cvode_mem: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn CVodeSensInit(
        cvode_mem: *mut ::std::os::raw::c_void,
        Ns: ::std::os::raw::c_int,
        ism: ::std::os::raw::c_int,
        fS: CVSensRhsFn,
        yS0: *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSensInit1(
        cvode_mem: *mut ::std::os::raw::c_void,
        Ns: ::std::os::raw::c_int,
        ism: ::std::os::raw::c_int,
        fS1: CVSensRhs1Fn,
        yS0: *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSensReInit(
        cvode_mem: *mut ::std::os::raw::c_void,
        ism: ::std::os::raw::c_int,
        yS0: *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSensSStolerances(
        cvode_mem: *mut ::std::os::raw::c_void,
        reltolS: sunrealtype,
        abstolS: *mut sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSensSVtolerances(
        cvode_mem: *mut ::std::os::raw::c_void,
        reltolS: sunrealtype,
        abstolS: *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSensEEtolerances(cvode_mem: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetSensDQMethod(
        cvode_mem: *mut ::std::os::raw::c_void,
        DQtype: ::std::os::raw::c_int,
        DQrhomax: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetSensErrCon(
        cvode_mem: *mut ::std::os::raw::c_void,
        errconS: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetSensMaxNonlinIters(
        cvode_mem: *mut ::std::os::raw::c_void,
        maxcorS: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetSensParams(
        cvode_mem: *mut ::std::os::raw::c_void,
        p: *mut sunrealtype,
        pbar: *mut sunrealtype,
        plist: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetNonlinearSolverSensSim(
        cvode_mem: *mut ::std::os::raw::c_void,
        NLS: SUNNonlinearSolver,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetNonlinearSolverSensStg(
        cvode_mem: *mut ::std::os::raw::c_void,
        NLS: SUNNonlinearSolver,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetNonlinearSolverSensStg1(
        cvode_mem: *mut ::std::os::raw::c_void,
        NLS: SUNNonlinearSolver,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSensToggleOff(cvode_mem: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetSens(
        cvode_mem: *mut ::std::os::raw::c_void,
        tret: *mut sunrealtype,
        ySout: *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetSens1(
        cvode_mem: *mut ::std::os::raw::c_void,
        tret: *mut sunrealtype,
        is: ::std::os::raw::c_int,
        ySout: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetSensDky(
        cvode_mem: *mut ::std::os::raw::c_void,
        t: sunrealtype,
        k: ::std::os::raw::c_int,
        dkyA: *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetSensDky1(
        cvode_mem: *mut ::std::os::raw::c_void,
        t: sunrealtype,
        k: ::std::os::raw::c_int,
        is: ::std::os::raw::c_int,
        dky: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetSensNumRhsEvals(
        cvode_mem: *mut ::std::os::raw::c_void,
        nfSevals: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetNumRhsEvalsSens(
        cvode_mem: *mut ::std::os::raw::c_void,
        nfevalsS: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetSensNumErrTestFails(
        cvode_mem: *mut ::std::os::raw::c_void,
        nSetfails: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetSensNumLinSolvSetups(
        cvode_mem: *mut ::std::os::raw::c_void,
        nlinsetupsS: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetSensErrWeights(
        cvode_mem: *mut ::std::os::raw::c_void,
        eSweight: *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetSensStats(
        cvode_mem: *mut ::std::os::raw::c_void,
        nfSevals: *mut ::std::os::raw::c_long,
        nfevalsS: *mut ::std::os::raw::c_long,
        nSetfails: *mut ::std::os::raw::c_long,
        nlinsetupsS: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetSensNumNonlinSolvIters(
        cvode_mem: *mut ::std::os::raw::c_void,
        nSniters: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetSensNumNonlinSolvConvFails(
        cvode_mem: *mut ::std::os::raw::c_void,
        nSnfails: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetSensNonlinSolvStats(
        cvode_mem: *mut ::std::os::raw::c_void,
        nSniters: *mut ::std::os::raw::c_long,
        nSnfails: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetNumStepSensSolveFails(
        cvode_mem: *mut ::std::os::raw::c_void,
        nSncfails: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetStgrSensNumNonlinSolvIters(
        cvode_mem: *mut ::std::os::raw::c_void,
        nSTGR1niters: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetStgrSensNumNonlinSolvConvFails(
        cvode_mem: *mut ::std::os::raw::c_void,
        nSTGR1nfails: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetStgrSensNonlinSolvStats(
        cvode_mem: *mut ::std::os::raw::c_void,
        nSTGR1niters: *mut ::std::os::raw::c_long,
        nSTGR1nfails: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetNumStepStgrSensSolveFails(
        cvode_mem: *mut ::std::os::raw::c_void,
        nSTGR1ncfails: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSensFree(cvode_mem: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn CVodeQuadSensInit(
        cvode_mem: *mut ::std::os::raw::c_void,
        fQS: CVQuadSensRhsFn,
        yQS0: *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeQuadSensReInit(
        cvode_mem: *mut ::std::os::raw::c_void,
        yQS0: *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeQuadSensSStolerances(
        cvode_mem: *mut ::std::os::raw::c_void,
        reltolQS: sunrealtype,
        abstolQS: *mut sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeQuadSensSVtolerances(
        cvode_mem: *mut ::std::os::raw::c_void,
        reltolQS: sunrealtype,
        abstolQS: *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeQuadSensEEtolerances(
        cvode_mem: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetQuadSensErrCon(
        cvode_mem: *mut ::std::os::raw::c_void,
        errconQS: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetQuadSens(
        cvode_mem: *mut ::std::os::raw::c_void,
        tret: *mut sunrealtype,
        yQSout: *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetQuadSens1(
        cvode_mem: *mut ::std::os::raw::c_void,
        tret: *mut sunrealtype,
        is: ::std::os::raw::c_int,
        yQSout: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetQuadSensDky(
        cvode_mem: *mut ::std::os::raw::c_void,
        t: sunrealtype,
        k: ::std::os::raw::c_int,
        dkyQS_all: *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetQuadSensDky1(
        cvode_mem: *mut ::std::os::raw::c_void,
        t: sunrealtype,
        k: ::std::os::raw::c_int,
        is: ::std::os::raw::c_int,
        dkyQS: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetQuadSensNumRhsEvals(
        cvode_mem: *mut ::std::os::raw::c_void,
        nfQSevals: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetQuadSensNumErrTestFails(
        cvode_mem: *mut ::std::os::raw::c_void,
        nQSetfails: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetQuadSensErrWeights(
        cvode_mem: *mut ::std::os::raw::c_void,
        eQSweight: *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetQuadSensStats(
        cvode_mem: *mut ::std::os::raw::c_void,
        nfQSevals: *mut ::std::os::raw::c_long,
        nQSetfails: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeQuadSensFree(cvode_mem: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn CVodeAdjInit(
        cvode_mem: *mut ::std::os::raw::c_void,
        steps: ::std::os::raw::c_long,
        interp: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeAdjReInit(cvode_mem: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeAdjFree(cvode_mem: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn CVodeCreateB(
        cvode_mem: *mut ::std::os::raw::c_void,
        lmmB: ::std::os::raw::c_int,
        which: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeInitB(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        fB: CVRhsFnB,
        tB0: sunrealtype,
        yB0: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeInitBS(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        fBs: CVRhsFnBS,
        tB0: sunrealtype,
        yB0: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeReInitB(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        tB0: sunrealtype,
        yB0: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSStolerancesB(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        reltolB: sunrealtype,
        abstolB: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSVtolerancesB(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        reltolB: sunrealtype,
        abstolB: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeQuadInitB(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        fQB: CVQuadRhsFnB,
        yQB0: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeQuadInitBS(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        fQBs: CVQuadRhsFnBS,
        yQB0: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeQuadReInitB(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        yQB0: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeQuadSStolerancesB(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        reltolQB: sunrealtype,
        abstolQB: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeQuadSVtolerancesB(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        reltolQB: sunrealtype,
        abstolQB: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeF(
        cvode_mem: *mut ::std::os::raw::c_void,
        tout: sunrealtype,
        yout: N_Vector,
        tret: *mut sunrealtype,
        itask: ::std::os::raw::c_int,
        ncheckPtr: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeB(
        cvode_mem: *mut ::std::os::raw::c_void,
        tBout: sunrealtype,
        itaskB: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetAdjNoSensi(cvode_mem: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetUserDataB(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        user_dataB: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetMaxOrdB(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        maxordB: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetMaxNumStepsB(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        mxstepsB: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetStabLimDetB(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        stldetB: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetInitStepB(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        hinB: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetMinStepB(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        hminB: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetMaxStepB(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        hmaxB: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetConstraintsB(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        constraintsB: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetQuadErrConB(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        errconQB: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetNonlinearSolverB(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        NLS: SUNNonlinearSolver,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetB(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        tBret: *mut sunrealtype,
        yB: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetQuadB(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        tBret: *mut sunrealtype,
        qB: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetAdjCVodeBmem(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn CVodeGetAdjY(
        cvode_mem: *mut ::std::os::raw::c_void,
        t: sunrealtype,
        y: N_Vector,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct CVadjCheckPointRec {
    pub my_addr: *mut ::std::os::raw::c_void,
    pub next_addr: *mut ::std::os::raw::c_void,
    pub t0: sunrealtype,
    pub t1: sunrealtype,
    pub nstep: ::std::os::raw::c_long,
    pub order: ::std::os::raw::c_int,
    pub step: sunrealtype,
}
#[test]
fn bindgen_test_layout_CVadjCheckPointRec() {
    const UNINIT: ::std::mem::MaybeUninit<CVadjCheckPointRec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<CVadjCheckPointRec>(),
        56usize,
        concat!("Size of: ", stringify!(CVadjCheckPointRec))
    );
    assert_eq!(
        ::std::mem::align_of::<CVadjCheckPointRec>(),
        8usize,
        concat!("Alignment of ", stringify!(CVadjCheckPointRec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).my_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(CVadjCheckPointRec),
            "::",
            stringify!(my_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next_addr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(CVadjCheckPointRec),
            "::",
            stringify!(next_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).t0) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(CVadjCheckPointRec),
            "::",
            stringify!(t0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).t1) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(CVadjCheckPointRec),
            "::",
            stringify!(t1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nstep) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(CVadjCheckPointRec),
            "::",
            stringify!(nstep)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).order) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(CVadjCheckPointRec),
            "::",
            stringify!(order)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).step) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(CVadjCheckPointRec),
            "::",
            stringify!(step)
        )
    );
}
impl Default for CVadjCheckPointRec {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn CVodeGetAdjCheckPointsInfo(
        cvode_mem: *mut ::std::os::raw::c_void,
        ckpnt: *mut CVadjCheckPointRec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeSetJacTimesRhsFnB(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        jtimesRhsFn: CVRhsFn,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetAdjDataPointHermite(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        t: *mut sunrealtype,
        y: N_Vector,
        yd: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetAdjDataPointPolynomial(
        cvode_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        t: *mut sunrealtype,
        order: *mut ::std::os::raw::c_int,
        y: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn CVodeGetAdjCurrentCheckPoint(
        cvode_mem: *mut ::std::os::raw::c_void,
        addr: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
pub type IDALsJacFn = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        c_j: sunrealtype,
        y: N_Vector,
        yp: N_Vector,
        r: N_Vector,
        Jac: SUNMatrix,
        user_data: *mut ::std::os::raw::c_void,
        tmp1: N_Vector,
        tmp2: N_Vector,
        tmp3: N_Vector,
    ) -> ::std::os::raw::c_int,
>;
pub type IDALsPrecSetupFn = ::std::option::Option<
    unsafe extern "C" fn(
        tt: sunrealtype,
        yy: N_Vector,
        yp: N_Vector,
        rr: N_Vector,
        c_j: sunrealtype,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type IDALsPrecSolveFn = ::std::option::Option<
    unsafe extern "C" fn(
        tt: sunrealtype,
        yy: N_Vector,
        yp: N_Vector,
        rr: N_Vector,
        rvec: N_Vector,
        zvec: N_Vector,
        c_j: sunrealtype,
        delta: sunrealtype,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type IDALsJacTimesSetupFn = ::std::option::Option<
    unsafe extern "C" fn(
        tt: sunrealtype,
        yy: N_Vector,
        yp: N_Vector,
        rr: N_Vector,
        c_j: sunrealtype,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type IDALsJacTimesVecFn = ::std::option::Option<
    unsafe extern "C" fn(
        tt: sunrealtype,
        yy: N_Vector,
        yp: N_Vector,
        rr: N_Vector,
        v: N_Vector,
        Jv: N_Vector,
        c_j: sunrealtype,
        user_data: *mut ::std::os::raw::c_void,
        tmp1: N_Vector,
        tmp2: N_Vector,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn IDASetLinearSolver(
        ida_mem: *mut ::std::os::raw::c_void,
        LS: SUNLinearSolver,
        A: SUNMatrix,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetJacFn(
        ida_mem: *mut ::std::os::raw::c_void,
        jac: IDALsJacFn,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetPreconditioner(
        ida_mem: *mut ::std::os::raw::c_void,
        pset: IDALsPrecSetupFn,
        psolve: IDALsPrecSolveFn,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetJacTimes(
        ida_mem: *mut ::std::os::raw::c_void,
        jtsetup: IDALsJacTimesSetupFn,
        jtimes: IDALsJacTimesVecFn,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetEpsLin(
        ida_mem: *mut ::std::os::raw::c_void,
        eplifac: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetLSNormFactor(
        ida_mem: *mut ::std::os::raw::c_void,
        nrmfac: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetLinearSolutionScaling(
        ida_mem: *mut ::std::os::raw::c_void,
        onoff: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetIncrementFactor(
        ida_mem: *mut ::std::os::raw::c_void,
        dqincfac: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetJac(
        ida_mem: *mut ::std::os::raw::c_void,
        J: *mut SUNMatrix,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetJacCj(
        ida_mem: *mut ::std::os::raw::c_void,
        cj_J: *mut sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetJacTime(
        ida_mem: *mut ::std::os::raw::c_void,
        t_J: *mut sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetJacNumSteps(
        ida_mem: *mut ::std::os::raw::c_void,
        nst_J: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetLinWorkSpace(
        ida_mem: *mut ::std::os::raw::c_void,
        lenrwLS: *mut ::std::os::raw::c_long,
        leniwLS: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetNumJacEvals(
        ida_mem: *mut ::std::os::raw::c_void,
        njevals: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetNumPrecEvals(
        ida_mem: *mut ::std::os::raw::c_void,
        npevals: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetNumPrecSolves(
        ida_mem: *mut ::std::os::raw::c_void,
        npsolves: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetNumLinIters(
        ida_mem: *mut ::std::os::raw::c_void,
        nliters: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetNumLinConvFails(
        ida_mem: *mut ::std::os::raw::c_void,
        nlcfails: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetNumJTSetupEvals(
        ida_mem: *mut ::std::os::raw::c_void,
        njtsetups: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetNumJtimesEvals(
        ida_mem: *mut ::std::os::raw::c_void,
        njvevals: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetNumLinResEvals(
        ida_mem: *mut ::std::os::raw::c_void,
        nrevalsLS: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetLastLinFlag(
        ida_mem: *mut ::std::os::raw::c_void,
        flag: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetLinReturnFlagName(flag: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
pub type IDAResFn = ::std::option::Option<
    unsafe extern "C" fn(
        tt: sunrealtype,
        yy: N_Vector,
        yp: N_Vector,
        rr: N_Vector,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type IDARootFn = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        y: N_Vector,
        yp: N_Vector,
        gout: *mut sunrealtype,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type IDAEwtFn = ::std::option::Option<
    unsafe extern "C" fn(
        y: N_Vector,
        ewt: N_Vector,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn IDACreate(sunctx: SUNContext) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn IDAInit(
        ida_mem: *mut ::std::os::raw::c_void,
        res: IDAResFn,
        t0: sunrealtype,
        yy0: N_Vector,
        yp0: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAReInit(
        ida_mem: *mut ::std::os::raw::c_void,
        t0: sunrealtype,
        yy0: N_Vector,
        yp0: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASStolerances(
        ida_mem: *mut ::std::os::raw::c_void,
        reltol: sunrealtype,
        abstol: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASVtolerances(
        ida_mem: *mut ::std::os::raw::c_void,
        reltol: sunrealtype,
        abstol: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAWFtolerances(
        ida_mem: *mut ::std::os::raw::c_void,
        efun: IDAEwtFn,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDACalcIC(
        ida_mem: *mut ::std::os::raw::c_void,
        icopt: ::std::os::raw::c_int,
        tout1: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetNonlinConvCoefIC(
        ida_mem: *mut ::std::os::raw::c_void,
        epiccon: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetMaxNumStepsIC(
        ida_mem: *mut ::std::os::raw::c_void,
        maxnh: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetMaxNumJacsIC(
        ida_mem: *mut ::std::os::raw::c_void,
        maxnj: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetMaxNumItersIC(
        ida_mem: *mut ::std::os::raw::c_void,
        maxnit: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetLineSearchOffIC(
        ida_mem: *mut ::std::os::raw::c_void,
        lsoff: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetStepToleranceIC(
        ida_mem: *mut ::std::os::raw::c_void,
        steptol: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetMaxBacksIC(
        ida_mem: *mut ::std::os::raw::c_void,
        maxbacks: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetDeltaCjLSetup(
        ida_max: *mut ::std::os::raw::c_void,
        dcj: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetUserData(
        ida_mem: *mut ::std::os::raw::c_void,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetMaxOrd(
        ida_mem: *mut ::std::os::raw::c_void,
        maxord: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetMaxNumSteps(
        ida_mem: *mut ::std::os::raw::c_void,
        mxsteps: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetInitStep(
        ida_mem: *mut ::std::os::raw::c_void,
        hin: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetMaxStep(
        ida_mem: *mut ::std::os::raw::c_void,
        hmax: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetMinStep(
        ida_mem: *mut ::std::os::raw::c_void,
        hmin: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetStopTime(
        ida_mem: *mut ::std::os::raw::c_void,
        tstop: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAClearStopTime(ida_mem: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetMaxErrTestFails(
        ida_mem: *mut ::std::os::raw::c_void,
        maxnef: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetSuppressAlg(
        ida_mem: *mut ::std::os::raw::c_void,
        suppressalg: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetId(ida_mem: *mut ::std::os::raw::c_void, id: N_Vector) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetConstraints(
        ida_mem: *mut ::std::os::raw::c_void,
        constraints: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetEtaFixedStepBounds(
        ida_mem: *mut ::std::os::raw::c_void,
        eta_min_fx: sunrealtype,
        eta_max_fx: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetEtaMin(
        ida_mem: *mut ::std::os::raw::c_void,
        eta_min: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetEtaMax(
        ida_mem: *mut ::std::os::raw::c_void,
        eta_max: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetEtaLow(
        ida_mem: *mut ::std::os::raw::c_void,
        eta_low: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetEtaMinErrFail(
        ida_mem: *mut ::std::os::raw::c_void,
        eta_min_ef: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetEtaConvFail(
        ida_mem: *mut ::std::os::raw::c_void,
        eta_cf: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetMaxConvFails(
        ida_mem: *mut ::std::os::raw::c_void,
        maxncf: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetMaxNonlinIters(
        ida_mem: *mut ::std::os::raw::c_void,
        maxcor: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetNlsResFn(
        IDA_mem: *mut ::std::os::raw::c_void,
        res: IDAResFn,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetNonlinConvCoef(
        ida_mem: *mut ::std::os::raw::c_void,
        epcon: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetNonlinearSolver(
        ida_mem: *mut ::std::os::raw::c_void,
        NLS: SUNNonlinearSolver,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDARootInit(
        ida_mem: *mut ::std::os::raw::c_void,
        nrtfn: ::std::os::raw::c_int,
        g: IDARootFn,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetRootDirection(
        ida_mem: *mut ::std::os::raw::c_void,
        rootdir: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetNoInactiveRootWarn(ida_mem: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASolve(
        ida_mem: *mut ::std::os::raw::c_void,
        tout: sunrealtype,
        tret: *mut sunrealtype,
        yret: N_Vector,
        ypret: N_Vector,
        itask: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAComputeY(
        ida_mem: *mut ::std::os::raw::c_void,
        ycor: N_Vector,
        y: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAComputeYp(
        ida_mem: *mut ::std::os::raw::c_void,
        ycor: N_Vector,
        yp: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetDky(
        ida_mem: *mut ::std::os::raw::c_void,
        t: sunrealtype,
        k: ::std::os::raw::c_int,
        dky: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetWorkSpace(
        ida_mem: *mut ::std::os::raw::c_void,
        lenrw: *mut ::std::os::raw::c_long,
        leniw: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetNumSteps(
        ida_mem: *mut ::std::os::raw::c_void,
        nsteps: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetNumResEvals(
        ida_mem: *mut ::std::os::raw::c_void,
        nrevals: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetNumLinSolvSetups(
        ida_mem: *mut ::std::os::raw::c_void,
        nlinsetups: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetNumErrTestFails(
        ida_mem: *mut ::std::os::raw::c_void,
        netfails: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetNumBacktrackOps(
        ida_mem: *mut ::std::os::raw::c_void,
        nbacktr: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetConsistentIC(
        ida_mem: *mut ::std::os::raw::c_void,
        yy0_mod: N_Vector,
        yp0_mod: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetLastOrder(
        ida_mem: *mut ::std::os::raw::c_void,
        klast: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetCurrentOrder(
        ida_mem: *mut ::std::os::raw::c_void,
        kcur: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetCurrentCj(
        ida_mem: *mut ::std::os::raw::c_void,
        cj: *mut sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetCurrentY(
        ida_mem: *mut ::std::os::raw::c_void,
        ycur: *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetCurrentYp(
        ida_mem: *mut ::std::os::raw::c_void,
        ypcur: *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetActualInitStep(
        ida_mem: *mut ::std::os::raw::c_void,
        hinused: *mut sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetLastStep(
        ida_mem: *mut ::std::os::raw::c_void,
        hlast: *mut sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetCurrentStep(
        ida_mem: *mut ::std::os::raw::c_void,
        hcur: *mut sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetCurrentTime(
        ida_mem: *mut ::std::os::raw::c_void,
        tcur: *mut sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetTolScaleFactor(
        ida_mem: *mut ::std::os::raw::c_void,
        tolsfact: *mut sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetErrWeights(
        ida_mem: *mut ::std::os::raw::c_void,
        eweight: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetEstLocalErrors(
        ida_mem: *mut ::std::os::raw::c_void,
        ele: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetNumGEvals(
        ida_mem: *mut ::std::os::raw::c_void,
        ngevals: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetRootInfo(
        ida_mem: *mut ::std::os::raw::c_void,
        rootsfound: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetIntegratorStats(
        ida_mem: *mut ::std::os::raw::c_void,
        nsteps: *mut ::std::os::raw::c_long,
        nrevals: *mut ::std::os::raw::c_long,
        nlinsetups: *mut ::std::os::raw::c_long,
        netfails: *mut ::std::os::raw::c_long,
        qlast: *mut ::std::os::raw::c_int,
        qcur: *mut ::std::os::raw::c_int,
        hinused: *mut sunrealtype,
        hlast: *mut sunrealtype,
        hcur: *mut sunrealtype,
        tcur: *mut sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetNonlinearSystemData(
        ida_mem: *mut ::std::os::raw::c_void,
        tcur: *mut sunrealtype,
        yypred: *mut N_Vector,
        yppred: *mut N_Vector,
        yyn: *mut N_Vector,
        ypn: *mut N_Vector,
        res: *mut N_Vector,
        cj: *mut sunrealtype,
        user_data: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetNumNonlinSolvIters(
        ida_mem: *mut ::std::os::raw::c_void,
        nniters: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetNumNonlinSolvConvFails(
        ida_mem: *mut ::std::os::raw::c_void,
        nnfails: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetNonlinSolvStats(
        ida_mem: *mut ::std::os::raw::c_void,
        nniters: *mut ::std::os::raw::c_long,
        nnfails: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetNumStepSolveFails(
        ida_mem: *mut ::std::os::raw::c_void,
        nncfails: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetUserData(
        ida_mem: *mut ::std::os::raw::c_void,
        user_data: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAPrintAllStats(
        ida_mem: *mut ::std::os::raw::c_void,
        outfile: *mut FILE,
        fmt: SUNOutputFormat,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetReturnFlagName(flag: ::std::os::raw::c_long) -> *mut ::std::os::raw::c_char;
}
extern "C" {
    pub fn IDAFree(ida_mem: *mut *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn IDASetJacTimesResFn(
        ida_mem: *mut ::std::os::raw::c_void,
        jtimesResFn: IDAResFn,
    ) -> ::std::os::raw::c_int;
}
pub type IDALsJacFnB = ::std::option::Option<
    unsafe extern "C" fn(
        tt: sunrealtype,
        c_jB: sunrealtype,
        yy: N_Vector,
        yp: N_Vector,
        yyB: N_Vector,
        ypB: N_Vector,
        rrB: N_Vector,
        JacB: SUNMatrix,
        user_dataB: *mut ::std::os::raw::c_void,
        tmp1B: N_Vector,
        tmp2B: N_Vector,
        tmp3B: N_Vector,
    ) -> ::std::os::raw::c_int,
>;
pub type IDALsJacFnBS = ::std::option::Option<
    unsafe extern "C" fn(
        tt: sunrealtype,
        c_jB: sunrealtype,
        yy: N_Vector,
        yp: N_Vector,
        yS: *mut N_Vector,
        ypS: *mut N_Vector,
        yyB: N_Vector,
        ypB: N_Vector,
        rrB: N_Vector,
        JacB: SUNMatrix,
        user_dataB: *mut ::std::os::raw::c_void,
        tmp1B: N_Vector,
        tmp2B: N_Vector,
        tmp3B: N_Vector,
    ) -> ::std::os::raw::c_int,
>;
pub type IDALsPrecSetupFnB = ::std::option::Option<
    unsafe extern "C" fn(
        tt: sunrealtype,
        yy: N_Vector,
        yp: N_Vector,
        yyB: N_Vector,
        ypB: N_Vector,
        rrB: N_Vector,
        c_jB: sunrealtype,
        user_dataB: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type IDALsPrecSetupFnBS = ::std::option::Option<
    unsafe extern "C" fn(
        tt: sunrealtype,
        yy: N_Vector,
        yp: N_Vector,
        yyS: *mut N_Vector,
        ypS: *mut N_Vector,
        yyB: N_Vector,
        ypB: N_Vector,
        rrB: N_Vector,
        c_jB: sunrealtype,
        user_dataB: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type IDALsPrecSolveFnB = ::std::option::Option<
    unsafe extern "C" fn(
        tt: sunrealtype,
        yy: N_Vector,
        yp: N_Vector,
        yyB: N_Vector,
        ypB: N_Vector,
        rrB: N_Vector,
        rvecB: N_Vector,
        zvecB: N_Vector,
        c_jB: sunrealtype,
        deltaB: sunrealtype,
        user_dataB: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type IDALsPrecSolveFnBS = ::std::option::Option<
    unsafe extern "C" fn(
        tt: sunrealtype,
        yy: N_Vector,
        yp: N_Vector,
        yyS: *mut N_Vector,
        ypS: *mut N_Vector,
        yyB: N_Vector,
        ypB: N_Vector,
        rrB: N_Vector,
        rvecB: N_Vector,
        zvecB: N_Vector,
        c_jB: sunrealtype,
        deltaB: sunrealtype,
        user_dataB: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type IDALsJacTimesSetupFnB = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        yy: N_Vector,
        yp: N_Vector,
        yyB: N_Vector,
        ypB: N_Vector,
        rrB: N_Vector,
        c_jB: sunrealtype,
        user_dataB: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type IDALsJacTimesSetupFnBS = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        yy: N_Vector,
        yp: N_Vector,
        yyS: *mut N_Vector,
        ypS: *mut N_Vector,
        yyB: N_Vector,
        ypB: N_Vector,
        rrB: N_Vector,
        c_jB: sunrealtype,
        user_dataB: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type IDALsJacTimesVecFnB = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        yy: N_Vector,
        yp: N_Vector,
        yyB: N_Vector,
        ypB: N_Vector,
        rrB: N_Vector,
        vB: N_Vector,
        JvB: N_Vector,
        c_jB: sunrealtype,
        user_dataB: *mut ::std::os::raw::c_void,
        tmp1B: N_Vector,
        tmp2B: N_Vector,
    ) -> ::std::os::raw::c_int,
>;
pub type IDALsJacTimesVecFnBS = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        yy: N_Vector,
        yp: N_Vector,
        yyS: *mut N_Vector,
        ypS: *mut N_Vector,
        yyB: N_Vector,
        ypB: N_Vector,
        rrB: N_Vector,
        vB: N_Vector,
        JvB: N_Vector,
        c_jB: sunrealtype,
        user_dataB: *mut ::std::os::raw::c_void,
        tmp1B: N_Vector,
        tmp2B: N_Vector,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn IDASetLinearSolverB(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        LS: SUNLinearSolver,
        A: SUNMatrix,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetJacFnB(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        jacB: IDALsJacFnB,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetJacFnBS(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        jacBS: IDALsJacFnBS,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetEpsLinB(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        eplifacB: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetLSNormFactorB(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        nrmfacB: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetLinearSolutionScalingB(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        onoffB: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetIncrementFactorB(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        dqincfacB: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetPreconditionerB(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        psetB: IDALsPrecSetupFnB,
        psolveB: IDALsPrecSolveFnB,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetPreconditionerBS(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        psetBS: IDALsPrecSetupFnBS,
        psolveBS: IDALsPrecSolveFnBS,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetJacTimesB(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        jtsetupB: IDALsJacTimesSetupFnB,
        jtimesB: IDALsJacTimesVecFnB,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetJacTimesBS(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        jtsetupBS: IDALsJacTimesSetupFnBS,
        jtimesBS: IDALsJacTimesVecFnBS,
    ) -> ::std::os::raw::c_int;
}
pub type IDAQuadRhsFn = ::std::option::Option<
    unsafe extern "C" fn(
        tres: sunrealtype,
        yy: N_Vector,
        yp: N_Vector,
        rrQ: N_Vector,
        user_data: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type IDASensResFn = ::std::option::Option<
    unsafe extern "C" fn(
        Ns: ::std::os::raw::c_int,
        t: sunrealtype,
        yy: N_Vector,
        yp: N_Vector,
        resval: N_Vector,
        yyS: *mut N_Vector,
        ypS: *mut N_Vector,
        resvalS: *mut N_Vector,
        user_data: *mut ::std::os::raw::c_void,
        tmp1: N_Vector,
        tmp2: N_Vector,
        tmp3: N_Vector,
    ) -> ::std::os::raw::c_int,
>;
pub type IDAQuadSensRhsFn = ::std::option::Option<
    unsafe extern "C" fn(
        Ns: ::std::os::raw::c_int,
        t: sunrealtype,
        yy: N_Vector,
        yp: N_Vector,
        yyS: *mut N_Vector,
        ypS: *mut N_Vector,
        rrQ: N_Vector,
        rhsvalQS: *mut N_Vector,
        user_data: *mut ::std::os::raw::c_void,
        yytmp: N_Vector,
        yptmp: N_Vector,
        tmpQS: N_Vector,
    ) -> ::std::os::raw::c_int,
>;
pub type IDAResFnB = ::std::option::Option<
    unsafe extern "C" fn(
        tt: sunrealtype,
        yy: N_Vector,
        yp: N_Vector,
        yyB: N_Vector,
        ypB: N_Vector,
        rrB: N_Vector,
        user_dataB: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type IDAResFnBS = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        yy: N_Vector,
        yp: N_Vector,
        yyS: *mut N_Vector,
        ypS: *mut N_Vector,
        yyB: N_Vector,
        ypB: N_Vector,
        rrBS: N_Vector,
        user_dataB: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type IDAQuadRhsFnB = ::std::option::Option<
    unsafe extern "C" fn(
        tt: sunrealtype,
        yy: N_Vector,
        yp: N_Vector,
        yyB: N_Vector,
        ypB: N_Vector,
        rhsvalBQ: N_Vector,
        user_dataB: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type IDAQuadRhsFnBS = ::std::option::Option<
    unsafe extern "C" fn(
        t: sunrealtype,
        yy: N_Vector,
        yp: N_Vector,
        yyS: *mut N_Vector,
        ypS: *mut N_Vector,
        yyB: N_Vector,
        ypB: N_Vector,
        rhsvalBQS: N_Vector,
        user_dataB: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
extern "C" {
    pub fn IDAComputeYSens(
        ida_mem: *mut ::std::os::raw::c_void,
        ycor: *mut N_Vector,
        yyS: *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAComputeYpSens(
        ida_mem: *mut ::std::os::raw::c_void,
        ycor: *mut N_Vector,
        ypS: *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetCurrentYSens(
        ida_mem: *mut ::std::os::raw::c_void,
        yS: *mut *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetCurrentYpSens(
        ida_mem: *mut ::std::os::raw::c_void,
        ypS: *mut *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetNonlinearSystemDataSens(
        ida_mem: *mut ::std::os::raw::c_void,
        tcur: *mut sunrealtype,
        yySpred: *mut *mut N_Vector,
        ypSpred: *mut *mut N_Vector,
        yySn: *mut *mut N_Vector,
        ypSn: *mut *mut N_Vector,
        cj: *mut sunrealtype,
        user_data: *mut *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAQuadInit(
        ida_mem: *mut ::std::os::raw::c_void,
        rhsQ: IDAQuadRhsFn,
        yQ0: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAQuadReInit(
        ida_mem: *mut ::std::os::raw::c_void,
        yQ0: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAQuadSStolerances(
        ida_mem: *mut ::std::os::raw::c_void,
        reltolQ: sunrealtype,
        abstolQ: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAQuadSVtolerances(
        ida_mem: *mut ::std::os::raw::c_void,
        reltolQ: sunrealtype,
        abstolQ: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetQuadErrCon(
        ida_mem: *mut ::std::os::raw::c_void,
        errconQ: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetQuad(
        ida_mem: *mut ::std::os::raw::c_void,
        t: *mut sunrealtype,
        yQout: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetQuadDky(
        ida_mem: *mut ::std::os::raw::c_void,
        t: sunrealtype,
        k: ::std::os::raw::c_int,
        dky: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetQuadNumRhsEvals(
        ida_mem: *mut ::std::os::raw::c_void,
        nrhsQevals: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetQuadNumErrTestFails(
        ida_mem: *mut ::std::os::raw::c_void,
        nQetfails: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetQuadErrWeights(
        ida_mem: *mut ::std::os::raw::c_void,
        eQweight: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetQuadStats(
        ida_mem: *mut ::std::os::raw::c_void,
        nrhsQevals: *mut ::std::os::raw::c_long,
        nQetfails: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAQuadFree(ida_mem: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn IDASensInit(
        ida_mem: *mut ::std::os::raw::c_void,
        Ns: ::std::os::raw::c_int,
        ism: ::std::os::raw::c_int,
        resS: IDASensResFn,
        yS0: *mut N_Vector,
        ypS0: *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASensReInit(
        ida_mem: *mut ::std::os::raw::c_void,
        ism: ::std::os::raw::c_int,
        yS0: *mut N_Vector,
        ypS0: *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASensSStolerances(
        ida_mem: *mut ::std::os::raw::c_void,
        reltolS: sunrealtype,
        abstolS: *mut sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASensSVtolerances(
        ida_mem: *mut ::std::os::raw::c_void,
        reltolS: sunrealtype,
        abstolS: *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASensEEtolerances(ida_mem: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetSensConsistentIC(
        ida_mem: *mut ::std::os::raw::c_void,
        yyS0: *mut N_Vector,
        ypS0: *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetSensDQMethod(
        ida_mem: *mut ::std::os::raw::c_void,
        DQtype: ::std::os::raw::c_int,
        DQrhomax: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetSensErrCon(
        ida_mem: *mut ::std::os::raw::c_void,
        errconS: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetSensMaxNonlinIters(
        ida_mem: *mut ::std::os::raw::c_void,
        maxcorS: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetSensParams(
        ida_mem: *mut ::std::os::raw::c_void,
        p: *mut sunrealtype,
        pbar: *mut sunrealtype,
        plist: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetNonlinearSolverSensSim(
        ida_mem: *mut ::std::os::raw::c_void,
        NLS: SUNNonlinearSolver,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetNonlinearSolverSensStg(
        ida_mem: *mut ::std::os::raw::c_void,
        NLS: SUNNonlinearSolver,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASensToggleOff(ida_mem: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetSens(
        ida_mem: *mut ::std::os::raw::c_void,
        tret: *mut sunrealtype,
        yySout: *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetSens1(
        ida_mem: *mut ::std::os::raw::c_void,
        tret: *mut sunrealtype,
        is: ::std::os::raw::c_int,
        yySret: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetSensDky(
        ida_mem: *mut ::std::os::raw::c_void,
        t: sunrealtype,
        k: ::std::os::raw::c_int,
        dkyS: *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetSensDky1(
        ida_mem: *mut ::std::os::raw::c_void,
        t: sunrealtype,
        k: ::std::os::raw::c_int,
        is: ::std::os::raw::c_int,
        dkyS: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetSensNumResEvals(
        ida_mem: *mut ::std::os::raw::c_void,
        nresSevals: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetNumResEvalsSens(
        ida_mem: *mut ::std::os::raw::c_void,
        nresevalsS: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetSensNumErrTestFails(
        ida_mem: *mut ::std::os::raw::c_void,
        nSetfails: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetSensNumLinSolvSetups(
        ida_mem: *mut ::std::os::raw::c_void,
        nlinsetupsS: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetSensErrWeights(
        ida_mem: *mut ::std::os::raw::c_void,
        eSweight: N_Vector_S,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetSensStats(
        ida_mem: *mut ::std::os::raw::c_void,
        nresSevals: *mut ::std::os::raw::c_long,
        nresevalsS: *mut ::std::os::raw::c_long,
        nSetfails: *mut ::std::os::raw::c_long,
        nlinsetupsS: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetSensNumNonlinSolvIters(
        ida_mem: *mut ::std::os::raw::c_void,
        nSniters: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetSensNumNonlinSolvConvFails(
        ida_mem: *mut ::std::os::raw::c_void,
        nSnfails: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetSensNonlinSolvStats(
        ida_mem: *mut ::std::os::raw::c_void,
        nSniters: *mut ::std::os::raw::c_long,
        nSnfails: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetNumStepSensSolveFails(
        ida_mem: *mut ::std::os::raw::c_void,
        nSncfails: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASensFree(ida_mem: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn IDAQuadSensInit(
        ida_mem: *mut ::std::os::raw::c_void,
        resQS: IDAQuadSensRhsFn,
        yQS0: *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAQuadSensReInit(
        ida_mem: *mut ::std::os::raw::c_void,
        yQS0: *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAQuadSensSStolerances(
        ida_mem: *mut ::std::os::raw::c_void,
        reltolQS: sunrealtype,
        abstolQS: *mut sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAQuadSensSVtolerances(
        ida_mem: *mut ::std::os::raw::c_void,
        reltolQS: sunrealtype,
        abstolQS: *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAQuadSensEEtolerances(ida_mem: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetQuadSensErrCon(
        ida_mem: *mut ::std::os::raw::c_void,
        errconQS: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetQuadSens(
        ida_mem: *mut ::std::os::raw::c_void,
        tret: *mut sunrealtype,
        yyQSout: *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetQuadSens1(
        ida_mem: *mut ::std::os::raw::c_void,
        tret: *mut sunrealtype,
        is: ::std::os::raw::c_int,
        yyQSret: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetQuadSensDky(
        ida_mem: *mut ::std::os::raw::c_void,
        t: sunrealtype,
        k: ::std::os::raw::c_int,
        dkyQS: *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetQuadSensDky1(
        ida_mem: *mut ::std::os::raw::c_void,
        t: sunrealtype,
        k: ::std::os::raw::c_int,
        is: ::std::os::raw::c_int,
        dkyQS: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetQuadSensNumRhsEvals(
        ida_mem: *mut ::std::os::raw::c_void,
        nrhsQSevals: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetQuadSensNumErrTestFails(
        ida_mem: *mut ::std::os::raw::c_void,
        nQSetfails: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetQuadSensErrWeights(
        ida_mem: *mut ::std::os::raw::c_void,
        eQSweight: *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetQuadSensStats(
        ida_mem: *mut ::std::os::raw::c_void,
        nrhsQSevals: *mut ::std::os::raw::c_long,
        nQSetfails: *mut ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAQuadSensFree(ida_mem: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn IDAAdjInit(
        ida_mem: *mut ::std::os::raw::c_void,
        steps: ::std::os::raw::c_long,
        interp: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAAdjReInit(ida_mem: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAAdjFree(ida_mem: *mut ::std::os::raw::c_void);
}
extern "C" {
    pub fn IDACreateB(
        ida_mem: *mut ::std::os::raw::c_void,
        which: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAInitB(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        resB: IDAResFnB,
        tB0: sunrealtype,
        yyB0: N_Vector,
        ypB0: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAInitBS(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        resS: IDAResFnBS,
        tB0: sunrealtype,
        yyB0: N_Vector,
        ypB0: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAReInitB(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        tB0: sunrealtype,
        yyB0: N_Vector,
        ypB0: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASStolerancesB(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        relTolB: sunrealtype,
        absTolB: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASVtolerancesB(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        relTolB: sunrealtype,
        absTolB: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAQuadInitB(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        rhsQB: IDAQuadRhsFnB,
        yQB0: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAQuadInitBS(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        rhsQS: IDAQuadRhsFnBS,
        yQB0: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAQuadReInitB(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        yQB0: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAQuadSStolerancesB(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        reltolQB: sunrealtype,
        abstolQB: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAQuadSVtolerancesB(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        reltolQB: sunrealtype,
        abstolQB: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDACalcICB(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        tout1: sunrealtype,
        yy0: N_Vector,
        yp0: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDACalcICBS(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        tout1: sunrealtype,
        yy0: N_Vector,
        yp0: N_Vector,
        yyS0: *mut N_Vector,
        ypS0: *mut N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASolveF(
        ida_mem: *mut ::std::os::raw::c_void,
        tout: sunrealtype,
        tret: *mut sunrealtype,
        yret: N_Vector,
        ypret: N_Vector,
        itask: ::std::os::raw::c_int,
        ncheckPtr: *mut ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASolveB(
        ida_mem: *mut ::std::os::raw::c_void,
        tBout: sunrealtype,
        itaskB: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAAdjSetNoSensi(ida_mem: *mut ::std::os::raw::c_void) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetUserDataB(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        user_dataB: *mut ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetMaxOrdB(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        maxordB: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetMaxNumStepsB(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        mxstepsB: ::std::os::raw::c_long,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetInitStepB(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        hinB: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetMaxStepB(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        hmaxB: sunrealtype,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetSuppressAlgB(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        suppressalgB: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetIdB(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        idB: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetConstraintsB(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        constraintsB: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetQuadErrConB(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        errconQB: ::std::os::raw::c_int,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetNonlinearSolverB(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        NLS: SUNNonlinearSolver,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetB(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        tret: *mut sunrealtype,
        yy: N_Vector,
        yp: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetQuadB(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        tret: *mut sunrealtype,
        qB: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetAdjIDABmem(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
    ) -> *mut ::std::os::raw::c_void;
}
extern "C" {
    pub fn IDAGetConsistentICB(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        yyB0: N_Vector,
        ypB0: N_Vector,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetAdjY(
        ida_mem: *mut ::std::os::raw::c_void,
        t: sunrealtype,
        yy: N_Vector,
        yp: N_Vector,
    ) -> ::std::os::raw::c_int;
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct IDAadjCheckPointRec {
    pub my_addr: *mut ::std::os::raw::c_void,
    pub next_addr: *mut ::std::os::raw::c_void,
    pub t0: sunrealtype,
    pub t1: sunrealtype,
    pub nstep: ::std::os::raw::c_long,
    pub order: ::std::os::raw::c_int,
    pub step: sunrealtype,
}
#[test]
fn bindgen_test_layout_IDAadjCheckPointRec() {
    const UNINIT: ::std::mem::MaybeUninit<IDAadjCheckPointRec> = ::std::mem::MaybeUninit::uninit();
    let ptr = UNINIT.as_ptr();
    assert_eq!(
        ::std::mem::size_of::<IDAadjCheckPointRec>(),
        56usize,
        concat!("Size of: ", stringify!(IDAadjCheckPointRec))
    );
    assert_eq!(
        ::std::mem::align_of::<IDAadjCheckPointRec>(),
        8usize,
        concat!("Alignment of ", stringify!(IDAadjCheckPointRec))
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).my_addr) as usize - ptr as usize },
        0usize,
        concat!(
            "Offset of field: ",
            stringify!(IDAadjCheckPointRec),
            "::",
            stringify!(my_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).next_addr) as usize - ptr as usize },
        8usize,
        concat!(
            "Offset of field: ",
            stringify!(IDAadjCheckPointRec),
            "::",
            stringify!(next_addr)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).t0) as usize - ptr as usize },
        16usize,
        concat!(
            "Offset of field: ",
            stringify!(IDAadjCheckPointRec),
            "::",
            stringify!(t0)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).t1) as usize - ptr as usize },
        24usize,
        concat!(
            "Offset of field: ",
            stringify!(IDAadjCheckPointRec),
            "::",
            stringify!(t1)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).nstep) as usize - ptr as usize },
        32usize,
        concat!(
            "Offset of field: ",
            stringify!(IDAadjCheckPointRec),
            "::",
            stringify!(nstep)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).order) as usize - ptr as usize },
        40usize,
        concat!(
            "Offset of field: ",
            stringify!(IDAadjCheckPointRec),
            "::",
            stringify!(order)
        )
    );
    assert_eq!(
        unsafe { ::std::ptr::addr_of!((*ptr).step) as usize - ptr as usize },
        48usize,
        concat!(
            "Offset of field: ",
            stringify!(IDAadjCheckPointRec),
            "::",
            stringify!(step)
        )
    );
}
impl Default for IDAadjCheckPointRec {
    fn default() -> Self {
        let mut s = ::std::mem::MaybeUninit::<Self>::uninit();
        unsafe {
            ::std::ptr::write_bytes(s.as_mut_ptr(), 0, 1);
            s.assume_init()
        }
    }
}
extern "C" {
    pub fn IDAGetAdjCheckPointsInfo(
        ida_mem: *mut ::std::os::raw::c_void,
        ckpnt: *mut IDAadjCheckPointRec,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDASetJacTimesResFnB(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        jtimesResFn: IDAResFn,
    ) -> ::std::os::raw::c_int;
}
extern "C" {
    pub fn IDAGetAdjDataPointHermite(
        ida_mem: *mut ::std::os::raw::c_void,
        which: ::std::os::raw::c_int,
        t: *mut sunrealtype,
        yy: N_Vector,
        yd: N_Vector,
    ) -> ::std::os::raw::c_int;
}
